dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2837xd/examples/cpu1/boostxl_afe031_f28379d_dacmode/cpu01/boostxl_afe031_f28379d_dacmode_isr.h
#if (G1_7PL >= G1_10PL) || (G1_7PL == 0)
#define  MG1_10_17PL    ~(1 << 6)
#else
#define  MG1_10_17PL    0xFFFF
#endif

#if (G1_8PL >= G1_10PL) || (G1_8PL == 0)
#define  MG1_10_18PL    ~(1 << 7)
#else
#define  MG1_10_18PL    0xFFFF
#endif

#if (G1_9PL >= G1_10PL) || (G1_9PL == 0)
#define  MG1_10_19PL    ~(1 << 8)
#else
#define  MG1_10_19PL    0xFFFF
#endif

#if (G1_11PL >= G1_10PL) || (G1_11PL == 0)
#define  MG1_10_111PL    ~(1 << 10)
#else
#define  MG1_10_111PL    0xFFFF
#endif

#if (G1_12PL >= G1_10PL) || (G1_12PL == 0)
#define  MG1_10_112PL    ~(1 << 11)
#else
#define  MG1_10_112PL    0xFFFF
#endif

#if (G1_13PL >= G1_10PL) || (G1_13PL == 0)
#define  MG1_10_113PL    ~(1 << 12)
#else
#define  MG1_10_113PL    0xFFFF
#endif

#if (G1_14PL >= G1_10PL) || (G1_14PL == 0)
#define  MG1_10_114PL    ~(1 << 13)
#else
#define  MG1_10_114PL    0xFFFF
#endif

#if (G1_15PL >= G1_10PL) || (G1_15PL == 0)
#define  MG1_10_115PL    ~(1 << 14)
#else
#define  MG1_10_115PL    0xFFFF
#endif

#if (G1_16PL >= G1_10PL) || (G1_16PL == 0)
#define  MG1_10_116PL    ~(1 << 15)
#else
#define  MG1_10_116PL    0xFFFF
#endif

#define  MG1_10_110PL	0xFDFF
#define  MG1_10    (MG1_10_11PL & MG1_10_12PL & MG1_10_13PL & MG1_10_14PL & \
                    MG1_10_15PL & MG1_10_16PL & MG1_10_17PL & MG1_10_18PL & \
                    MG1_10_19PL & MG1_10_110PL & MG1_10_111PL & MG1_10_112PL & \
                    MG1_10_113PL & MG1_10_114PL & MG1_10_115PL & MG1_10_116PL)
// End of MG1_10:
// Beginning of MG111:
#if (G1_1PL >= G1_11PL) || (G1_1PL == 0)
#define  MG1_11_11PL    ~(1 << 0)
#else
#define  MG1_11_11PL    0xFFFF
#endif

#if (G1_2PL >= G1_11PL) || (G1_2PL == 0)
#define  MG1_11_12PL    ~(1 << 1)
#else
#define  MG1_11_12PL    0xFFFF
#endif

#if (G1_3PL >= G1_11PL) || (G1_3PL == 0)
#define  MG1_11_13PL    ~(1 << 2)
#else
#define  MG1_11_13PL    0xFFFF
#endif

#if (G1_4PL >= G1_11PL) || (G1_4PL == 0)
#define  MG1_11_14PL    ~(1 << 3)
#else
#define  MG1_11_14PL    0xFFFF
#endif

#if (G1_5PL >= G1_11PL) || (G1_5PL == 0)
#define  MG1_11_15PL    ~(1 << 4)
#else
#define  MG1_11_15PL    0xFFFF
#endif

#if (G1_6PL >= G1_11PL) || (G1_6PL == 0)
#define  MG1_11_16PL    ~(1 << 5)
#else
#define  MG1_11_16PL    0xFFFF
#endif

#if (G1_7PL >= G1_11PL) || (G1_7PL == 0)
#define  MG1_11_17PL    ~(1 << 6)
#else
#define  MG1_11_17PL    0xFFFF
#endif

#if (G1_8PL >= G1_11PL) || (G1_8PL == 0)
#define  MG1_11_18PL    ~(1 << 7)
#else
#define  MG1_11_18PL    0xFFFF
#endif

#if (G1_9PL >= G1_11PL) || (G1_9PL == 0)
#define  MG1_11_19PL    ~(1 << 8)
#else
#define  MG1_11_19PL    0xFFFF
#endif

#if (G1_10PL >= G1_11PL) || (G1_10PL == 0)
#define  MG1_11_110PL    ~(1 << 9)
#else
#define  MG1_11_110PL    0xFFFF
#endif

#if (G1_12PL >= G1_11PL) || (G1_12PL == 0)
#define  MG1_11_112PL    ~(1 << 11)
#else
#define  MG1_11_112PL    0xFFFF
#endif

#if (G1_13PL >= G1_11PL) || (G1_13PL == 0)
#define  MG1_11_113PL    ~(1 << 12)
#else
#define  MG1_11_113PL    0xFFFF
#endif

#if (G1_14PL >= G1_11PL) || (G1_14PL == 0)
#define  MG1_11_114PL    ~(1 << 13)
#else
#define  MG1_11_114PL    0xFFFF
#endif

#if (G1_15PL >= G1_11PL) || (G1_15PL == 0)
#define  MG1_11_115PL    ~(1 << 14)
#else
#define  MG1_11_115PL    0xFFFF
#endif

#if (G1_16PL >= G1_11PL) || (G1_16PL == 0)
#define  MG1_11_116PL    ~(1 << 15)
#else
#define  MG1_11_116PL    0xFFFF
#endif

#define  MG1_11_111PL	0xFBFF
#define  MG1_11    (MG1_11_11PL & MG1_11_12PL & MG1_11_13PL & MG1_11_14PL & \
                    MG1_11_15PL & MG1_11_16PL & MG1_11_17PL & MG1_11_18PL & \
                    MG1_11_19PL & MG1_11_110PL & MG1_11_111PL & MG1_11_112PL & \
                    MG1_11_113PL & MG1_11_114PL & MG1_11_115PL & MG1_11_116PL)
// End of MG1_11:
// Beginning of MG112:
#if (G1_1PL >= G1_12PL) || (G1_1PL == 0)
#define  MG1_12_11PL    ~(1 << 0)
#else
#define  MG1_12_11PL    0xFFFF
#endif

#if (G1_2PL >= G1_12PL) || (G1_2PL == 0)
#define  MG1_12_12PL    ~(1 << 1)
#else
#define  MG1_12_12PL    0xFFFF
#endif

#if (G1_3PL >= G1_12PL) || (G1_3PL == 0)
#define  MG1_12_13PL    ~(1 << 2)
#else
#define  MG1_12_13PL    0xFFFF
#endif

#if (G1_4PL >= G1_12PL) || (G1_4PL == 0)
#define  MG1_12_14PL    ~(1 << 3)
#else
#define  MG1_12_14PL    0xFFFF
#endif

#if (G1_5PL >= G1_12PL) || (G1_5PL == 0)
#define  MG1_12_15PL    ~(1 << 4)
#else
#define  MG1_12_15PL    0xFFFF
#endif

#if (G1_6PL >= G1_12PL) || (G1_6PL == 0)
#define  MG1_12_16PL    ~(1 << 5)
#else
#define  MG1_12_16PL    0xFFFF
#endif

#if (G1_7PL >= G1_12PL) || (G1_7PL == 0)
#define  MG1_12_17PL    ~(1 << 6)
#else
#define  MG1_12_17PL    0xFFFF
#endif

#if (G1_8PL >= G1_12PL) || (G1_8PL == 0)
#define  MG1_12_18PL    ~(1 << 7)
#else
#define  MG1_12_18PL    0xFFFF
#endif

#if (G1_9PL >= G1_12PL) || (G1_9PL == 0)
#define  MG1_12_19PL    ~(1 << 8)
#else
#define  MG1_12_19PL    0xFFFF
#endif

#if (G1_10PL >= G1_12PL) || (G1_10PL == 0)
#define  MG1_12_110PL    ~(1 << 9)
#else
#define  MG1_12_110PL    0xFFFF
#endif

#if (G1_11PL >= G1_12PL) || (G1_11PL == 0)
#define  MG1_12_111PL    ~(1 << 10)
#else
#define  MG1_12_111PL    0xFFFF
#endif

#if (G1_13PL >= G1_12PL) || (G1_13PL == 0)
#define  MG1_12_113PL    ~(1 << 12)
#else
#define  MG1_12_113PL    0xFFFF
#endif

#if (G1_14PL >= G1_12PL) || (G1_14PL == 0)
#define  MG1_12_114PL    ~(1 << 13)
#else
#define  MG1_12_114PL    0xFFFF
#endif

#if (G1_15PL >= G1_12PL) || (G1_15PL == 0)
#define  MG1_12_115PL    ~(1 << 14)
#else
#define  MG1_12_115PL    0xFFFF
#endif

#if (G1_16PL >= G1_12PL) || (G1_16PL == 0)
#define  MG1_12_116PL    ~(1 << 15)
#else
#define  MG1_12_116PL    0xFFFF
#endif

#define  MG1_12_112PL	0xF7FF
#define  MG1_12    (MG1_12_11PL & MG1_12_12PL & MG1_12_13PL & MG1_12_14PL & \
                    MG1_12_15PL & MG1_12_16PL & MG1_12_17PL & MG1_12_18PL & \
                    MG1_12_19PL & MG1_12_110PL & MG1_12_111PL & MG1_12_112PL & \
                    MG1_12_113PL & MG1_12_114PL & MG1_12_115PL & MG1_12_116PL)
// End of MG1_12:
// Beginning of MG113:
#if (G1_1PL >= G1_13PL) || (G1_1PL == 0)
#define  MG1_13_11PL    ~(1 << 0)
#else
#define  MG1_13_11PL    0xFFFF
#endif

