dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2837xd/examples/cpu1/boostxl_afe031_f28379d_dacmode/cpu01/boostxl_afe031_f28379d_dacmode_isr.h
#if (G1_2PL >= G1_13PL) || (G1_2PL == 0)
#define  MG1_13_12PL    ~(1 << 1)
#else
#define  MG1_13_12PL    0xFFFF
#endif

#if (G1_3PL >= G1_13PL) || (G1_3PL == 0)
#define  MG1_13_13PL    ~(1 << 2)
#else
#define  MG1_13_13PL    0xFFFF
#endif

#if (G1_4PL >= G1_13PL) || (G1_4PL == 0)
#define  MG1_13_14PL    ~(1 << 3)
#else
#define  MG1_13_14PL    0xFFFF
#endif

#if (G1_5PL >= G1_13PL) || (G1_5PL == 0)
#define  MG1_13_15PL    ~(1 << 4)
#else
#define  MG1_13_15PL    0xFFFF
#endif

#if (G1_6PL >= G1_13PL) || (G1_6PL == 0)
#define  MG1_13_16PL    ~(1 << 5)
#else
#define  MG1_13_16PL    0xFFFF
#endif

#if (G1_7PL >= G1_13PL) || (G1_7PL == 0)
#define  MG1_13_17PL    ~(1 << 6)
#else
#define  MG1_13_17PL    0xFFFF
#endif

#if (G1_8PL >= G1_13PL) || (G1_8PL == 0)
#define  MG1_13_18PL    ~(1 << 7)
#else
#define  MG1_13_18PL    0xFFFF
#endif

#if (G1_9PL >= G1_13PL) || (G1_9PL == 0)
#define  MG1_13_19PL    ~(1 << 8)
#else
#define  MG1_13_19PL    0xFFFF
#endif

#if (G1_10PL >= G1_13PL) || (G1_10PL == 0)
#define  MG1_13_110PL    ~(1 << 9)
#else
#define  MG1_13_110PL    0xFFFF
#endif

#if (G1_11PL >= G1_13PL) || (G1_11PL == 0)
#define  MG1_13_111PL    ~(1 << 10)
#else
#define  MG1_13_111PL    0xFFFF
#endif

#if (G1_12PL >= G1_13PL) || (G1_12PL == 0)
#define  MG1_13_112PL    ~(1 << 11)
#else
#define  MG1_13_112PL    0xFFFF
#endif

#if (G1_14PL >= G1_13PL) || (G1_14PL == 0)
#define  MG1_13_114PL    ~(1 << 13)
#else
#define  MG1_13_114PL    0xFFFF
#endif

#if (G1_15PL >= G1_13PL) || (G1_15PL == 0)
#define  MG1_13_115PL    ~(1 << 14)
#else
#define  MG1_13_115PL    0xFFFF
#endif

#if (G1_16PL >= G1_13PL) || (G1_16PL == 0)
#define  MG1_13_116PL    ~(1 << 15)
#else
#define  MG1_13_116PL    0xFFFF
#endif

#define  MG1_13_113PL	0xEFFF
#define  MG1_13    (MG1_13_11PL & MG1_13_12PL & MG1_13_13PL & MG1_13_14PL & \
                    MG1_13_15PL & MG1_13_16PL & MG1_13_17PL & MG1_13_18PL & \
                    MG1_13_19PL & MG1_13_110PL & MG1_13_111PL & MG1_13_112PL & \
                    MG1_13_113PL & MG1_13_114PL & MG1_13_115PL & MG1_13_116PL)
// End of MG1_13:
// Beginning of MG114:
#if (G1_1PL >= G1_14PL) || (G1_1PL == 0)
#define  MG1_14_11PL    ~(1 << 0)
#else
#define  MG1_14_11PL    0xFFFF
#endif

#if (G1_2PL >= G1_14PL) || (G1_2PL == 0)
#define  MG1_14_12PL    ~(1 << 1)
#else
#define  MG1_14_12PL    0xFFFF
#endif

#if (G1_3PL >= G1_14PL) || (G1_3PL == 0)
#define  MG1_14_13PL    ~(1 << 2)
#else
#define  MG1_14_13PL    0xFFFF
#endif

#if (G1_4PL >= G1_14PL) || (G1_4PL == 0)
#define  MG1_14_14PL    ~(1 << 3)
#else
#define  MG1_14_14PL    0xFFFF
#endif

#if (G1_5PL >= G1_14PL) || (G1_5PL == 0)
#define  MG1_14_15PL    ~(1 << 4)
#else
#define  MG1_14_15PL    0xFFFF
#endif

#if (G1_6PL >= G1_14PL) || (G1_6PL == 0)
#define  MG1_14_16PL    ~(1 << 5)
#else
#define  MG1_14_16PL    0xFFFF
#endif

#if (G1_7PL >= G1_14PL) || (G1_7PL == 0)
#define  MG1_14_17PL    ~(1 << 6)
#else
#define  MG1_14_17PL    0xFFFF
#endif

#if (G1_8PL >= G1_14PL) || (G1_8PL == 0)
#define  MG1_14_18PL    ~(1 << 7)
#else
#define  MG1_14_18PL    0xFFFF
#endif

#if (G1_9PL >= G1_14PL) || (G1_9PL == 0)
#define  MG1_14_19PL    ~(1 << 8)
#else
#define  MG1_14_19PL    0xFFFF
#endif

#if (G1_10PL >= G1_14PL) || (G1_10PL == 0)
#define  MG1_14_110PL    ~(1 << 9)
#else
#define  MG1_14_110PL    0xFFFF
#endif

#if (G1_11PL >= G1_14PL) || (G1_11PL == 0)
#define  MG1_14_111PL    ~(1 << 10)
#else
#define  MG1_14_111PL    0xFFFF
#endif

#if (G1_12PL >= G1_14PL) || (G1_12PL == 0)
#define  MG1_14_112PL    ~(1 << 11)
#else
#define  MG1_14_112PL    0xFFFF
#endif

#if (G1_13PL >= G1_14PL) || (G1_13PL == 0)
#define  MG1_14_113PL    ~(1 << 12)
#else
#define  MG1_14_113PL    0xFFFF
#endif

#if (G1_15PL >= G1_14PL) || (G1_15PL == 0)
#define  MG1_14_115PL    ~(1 << 14)
#else
#define  MG1_14_115PL    0xFFFF
#endif

#if (G1_16PL >= G1_14PL) || (G1_16PL == 0)
#define  MG1_14_116PL    ~(1 << 15)
#else
#define  MG1_14_116PL    0xFFFF
#endif

#define  MG1_14_114PL	0xDFFF
#define  MG1_14    (MG1_14_11PL & MG1_14_12PL & MG1_14_13PL & MG1_14_14PL & \
                    MG1_14_15PL & MG1_14_16PL & MG1_14_17PL & MG1_14_18PL & \
                    MG1_14_19PL & MG1_14_110PL & MG1_14_111PL & MG1_14_112PL & \
                    MG1_14_113PL & MG1_14_114PL & MG1_14_115PL & MG1_14_116PL)
// End of MG1_14:
// Beginning of MG115:
#if (G1_1PL >= G1_15PL) || (G1_1PL == 0)
#define  MG1_15_11PL    ~(1 << 0)
#else
#define  MG1_15_11PL    0xFFFF
#endif

#if (G1_2PL >= G1_15PL) || (G1_2PL == 0)
#define  MG1_15_12PL    ~(1 << 1)
#else
#define  MG1_15_12PL    0xFFFF
#endif

#if (G1_3PL >= G1_15PL) || (G1_3PL == 0)
#define  MG1_15_13PL    ~(1 << 2)
#else
#define  MG1_15_13PL    0xFFFF
#endif

#if (G1_4PL >= G1_15PL) || (G1_4PL == 0)
#define  MG1_15_14PL    ~(1 << 3)
#else
#define  MG1_15_14PL    0xFFFF
#endif

#if (G1_5PL >= G1_15PL) || (G1_5PL == 0)
#define  MG1_15_15PL    ~(1 << 4)
#else
#define  MG1_15_15PL    0xFFFF
#endif

#if (G1_6PL >= G1_15PL) || (G1_6PL == 0)
#define  MG1_15_16PL    ~(1 << 5)
#else
#define  MG1_15_16PL    0xFFFF
#endif

#if (G1_7PL >= G1_15PL) || (G1_7PL == 0)
#define  MG1_15_17PL    ~(1 << 6)
#else
#define  MG1_15_17PL    0xFFFF
#endif

#if (G1_8PL >= G1_15PL) || (G1_8PL == 0)
#define  MG1_15_18PL    ~(1 << 7)
#else
#define  MG1_15_18PL    0xFFFF
#endif

#if (G1_9PL >= G1_15PL) || (G1_9PL == 0)
#define  MG1_15_19PL    ~(1 << 8)
#else
#define  MG1_15_19PL    0xFFFF
#endif

#if (G1_10PL >= G1_15PL) || (G1_10PL == 0)
#define  MG1_15_110PL    ~(1 << 9)
#else
#define  MG1_15_110PL    0xFFFF
#endif

#if (G1_11PL >= G1_15PL) || (G1_11PL == 0)
#define  MG1_15_111PL    ~(1 << 10)
#else
#define  MG1_15_111PL    0xFFFF
#endif

#if (G1_12PL >= G1_15PL) || (G1_12PL == 0)
#define  MG1_15_112PL    ~(1 << 11)
#else
#define  MG1_15_112PL    0xFFFF
#endif

#if (G1_13PL >= G1_15PL) || (G1_13PL == 0)
#define  MG1_15_113PL    ~(1 << 12)
#else
#define  MG1_15_113PL    0xFFFF
#endif

#if (G1_14PL >= G1_15PL) || (G1_14PL == 0)
#define  MG1_15_114PL    ~(1 << 13)
#else
#define  MG1_15_114PL    0xFFFF
#endif

#if (G1_16PL >= G1_15PL) || (G1_16PL == 0)
#define  MG1_15_116PL    ~(1 << 15)
#else
#define  MG1_15_116PL    0xFFFF
#endif

#define  MG1_15_115PL	0xBFFF
#define  MG1_15    (MG1_15_11PL & MG1_15_12PL & MG1_15_13PL & MG1_15_14PL & \
                    MG1_15_15PL & MG1_15_16PL & MG1_15_17PL & MG1_15_18PL & \
                    MG1_15_19PL & MG1_15_110PL & MG1_15_111PL & MG1_15_112PL & \
                    MG1_15_113PL & MG1_15_114PL & MG1_15_115PL & MG1_15_116PL)
// End of MG1_15:
// Beginning of MG116:
#if (G1_1PL >= G1_16PL) || (G1_1PL == 0)
#define  MG1_16_11PL    ~(1 << 0)
#else
#define  MG1_16_11PL    0xFFFF
#endif

#if (G1_2PL >= G1_16PL) || (G1_2PL == 0)
#define  MG1_16_12PL    ~(1 << 1)
#else
#define  MG1_16_12PL    0xFFFF
#endif

