dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2837xd/examples/cpu1/boostxl_afe031_f28379d_dacmode/cpu01/boostxl_afe031_f28379d_dacmode_isr.h
#if (G1_3PL >= G1_16PL) || (G1_3PL == 0)
#define  MG1_16_13PL    ~(1 << 2)
#else
#define  MG1_16_13PL    0xFFFF
#endif

#if (G1_4PL >= G1_16PL) || (G1_4PL == 0)
#define  MG1_16_14PL    ~(1 << 3)
#else
#define  MG1_16_14PL    0xFFFF
#endif

#if (G1_5PL >= G1_16PL) || (G1_5PL == 0)
#define  MG1_16_15PL    ~(1 << 4)
#else
#define  MG1_16_15PL    0xFFFF
#endif

#if (G1_6PL >= G1_16PL) || (G1_6PL == 0)
#define  MG1_16_16PL    ~(1 << 5)
#else
#define  MG1_16_16PL    0xFFFF
#endif

#if (G1_7PL >= G1_16PL) || (G1_7PL == 0)
#define  MG1_16_17PL    ~(1 << 6)
#else
#define  MG1_16_17PL    0xFFFF
#endif

#if (G1_8PL >= G1_16PL) || (G1_8PL == 0)
#define  MG1_16_18PL    ~(1 << 7)
#else
#define  MG1_16_18PL    0xFFFF
#endif

#if (G1_9PL >= G1_16PL) || (G1_9PL == 0)
#define  MG1_16_19PL    ~(1 << 8)
#else
#define  MG1_16_19PL    0xFFFF
#endif

#if (G1_10PL >= G1_16PL) || (G1_10PL == 0)
#define  MG1_16_110PL    ~(1 << 9)
#else
#define  MG1_16_110PL    0xFFFF
#endif

#if (G1_11PL >= G1_16PL) || (G1_11PL == 0)
#define  MG1_16_111PL    ~(1 << 10)
#else
#define  MG1_16_111PL    0xFFFF
#endif

#if (G1_12PL >= G1_16PL) || (G1_12PL == 0)
#define  MG1_16_112PL    ~(1 << 11)
#else
#define  MG1_16_112PL    0xFFFF
#endif

#if (G1_13PL >= G1_16PL) || (G1_13PL == 0)
#define  MG1_16_113PL    ~(1 << 12)
#else
#define  MG1_16_113PL    0xFFFF
#endif

#if (G1_14PL >= G1_16PL) || (G1_14PL == 0)
#define  MG1_16_114PL    ~(1 << 13)
#else
#define  MG1_16_114PL    0xFFFF
#endif

#if (G1_15PL >= G1_16PL) || (G1_15PL == 0)
#define  MG1_16_115PL    ~(1 << 14)
#else
#define  MG1_16_115PL    0xFFFF
#endif

#define  MG1_16_116PL	0x7FFF
#define  MG1_16    (MG1_16_11PL & MG1_16_12PL & MG1_16_13PL & MG1_16_14PL & \
                    MG1_16_15PL & MG1_16_16PL & MG1_16_17PL & MG1_16_18PL & \
                    MG1_16_19PL & MG1_16_110PL & MG1_16_111PL & MG1_16_112PL & \
                    MG1_16_113PL & MG1_16_114PL & MG1_16_115PL & MG1_16_116PL)
// End of MG1_16:


//
// Automatically generate PIEIER2 interrupt masks MG21 to MG216:
//

// Beginning of MG21:
#if (G2_2PL >= G2_1PL) || (G2_2PL == 0)
#define  MG2_1_12PL    ~(1 << 1)
#else
#define  MG2_1_12PL    0xFFFF
#endif

#if (G2_3PL >= G2_1PL) || (G2_3PL == 0)
#define  MG2_1_13PL    ~(1 << 2)
#else
#define  MG2_1_13PL    0xFFFF
#endif

#if (G2_4PL >= G2_1PL) || (G2_4PL == 0)
#define  MG2_1_14PL    ~(1 << 3)
#else
#define  MG2_1_14PL    0xFFFF
#endif

#if (G2_5PL >= G2_1PL) || (G2_5PL == 0)
#define  MG2_1_15PL    ~(1 << 4)
#else
#define  MG2_1_15PL    0xFFFF
#endif

#if (G2_6PL >= G2_1PL) || (G2_6PL == 0)
#define  MG2_1_16PL    ~(1 << 5)
#else
#define  MG2_1_16PL    0xFFFF
#endif

#if (G2_7PL >= G2_1PL) || (G2_7PL == 0)
#define  MG2_1_17PL    ~(1 << 6)
#else
#define  MG2_1_17PL    0xFFFF
#endif

#if (G2_8PL >= G2_1PL) || (G2_8PL == 0)
#define  MG2_1_18PL    ~(1 << 7)
#else
#define  MG2_1_18PL    0xFFFF
#endif

#if (G2_9PL >= G2_1PL) || (G2_9PL == 0)
#define  MG2_1_19PL    ~(1 << 8)
#else
#define  MG2_1_19PL    0xFFFF
#endif

#if (G2_10PL >= G2_1PL) || (G2_10PL == 0)
#define  MG2_1_110PL    ~(1 << 9)
#else
#define  MG2_1_110PL    0xFFFF
#endif

#if (G2_11PL >= G2_1PL) || (G2_11PL == 0)
#define  MG2_1_111PL    ~(1 << 10)
#else
#define  MG2_1_111PL    0xFFFF
#endif

#if (G2_12PL >= G2_1PL) || (G2_12PL == 0)
#define  MG2_1_112PL    ~(1 << 11)
#else
#define  MG2_1_112PL    0xFFFF
#endif

#if (G2_13PL >= G2_1PL) || (G2_13PL == 0)
#define  MG2_1_113PL    ~(1 << 12)
#else
#define  MG2_1_113PL    0xFFFF
#endif

#if (G2_14PL >= G2_1PL) || (G2_14PL == 0)
#define  MG2_1_114PL    ~(1 << 13)
#else
#define  MG2_1_114PL    0xFFFF
#endif

#if (G2_15PL >= G2_1PL) || (G2_15PL == 0)
#define  MG2_1_115PL    ~(1 << 14)
#else
#define  MG2_1_115PL    0xFFFF
#endif

#if (G2_16PL >= G2_1PL) || (G2_16PL == 0)
#define  MG2_1_116PL    ~(1 << 15)
#else
#define  MG2_1_116PL    0xFFFF
#endif

#define  MG2_1_11PL	0xFFFE
#define  MG2_1    (MG2_1_11PL & MG2_1_12PL & MG2_1_13PL & MG2_1_14PL & \
                    MG2_1_15PL & MG2_1_16PL & MG2_1_17PL & MG2_1_18PL & \
                    MG2_1_19PL & MG2_1_110PL & MG2_1_111PL & MG2_1_112PL & \
                    MG2_1_113PL & MG2_1_114PL & MG2_1_115PL & MG2_1_116PL)
// End of MG2_1:
// Beginning of MG22:
#if (G2_1PL >= G2_2PL) || (G2_1PL == 0)
#define  MG2_2_11PL    ~(1 << 0)
#else
#define  MG2_2_11PL    0xFFFF
#endif

#if (G2_3PL >= G2_2PL) || (G2_3PL == 0)
#define  MG2_2_13PL    ~(1 << 2)
#else
#define  MG2_2_13PL    0xFFFF
#endif

#if (G2_4PL >= G2_2PL) || (G2_4PL == 0)
#define  MG2_2_14PL    ~(1 << 3)
#else
#define  MG2_2_14PL    0xFFFF
#endif

#if (G2_5PL >= G2_2PL) || (G2_5PL == 0)
#define  MG2_2_15PL    ~(1 << 4)
#else
#define  MG2_2_15PL    0xFFFF
#endif

#if (G2_6PL >= G2_2PL) || (G2_6PL == 0)
#define  MG2_2_16PL    ~(1 << 5)
#else
#define  MG2_2_16PL    0xFFFF
#endif

#if (G2_7PL >= G2_2PL) || (G2_7PL == 0)
#define  MG2_2_17PL    ~(1 << 6)
#else
#define  MG2_2_17PL    0xFFFF
#endif

#if (G2_8PL >= G2_2PL) || (G2_8PL == 0)
#define  MG2_2_18PL    ~(1 << 7)
#else
#define  MG2_2_18PL    0xFFFF
#endif

#if (G2_9PL >= G2_2PL) || (G2_9PL == 0)
#define  MG2_2_19PL    ~(1 << 8)
#else
#define  MG2_2_19PL    0xFFFF
#endif

#if (G2_10PL >= G2_2PL) || (G2_10PL == 0)
#define  MG2_2_110PL    ~(1 << 9)
#else
#define  MG2_2_110PL    0xFFFF
#endif

#if (G2_11PL >= G2_2PL) || (G2_11PL == 0)
#define  MG2_2_111PL    ~(1 << 10)
#else
#define  MG2_2_111PL    0xFFFF
#endif

#if (G2_12PL >= G2_2PL) || (G2_12PL == 0)
#define  MG2_2_112PL    ~(1 << 11)
#else
#define  MG2_2_112PL    0xFFFF
#endif

#if (G2_13PL >= G2_2PL) || (G2_13PL == 0)
#define  MG2_2_113PL    ~(1 << 12)
#else
#define  MG2_2_113PL    0xFFFF
#endif

#if (G2_14PL >= G2_2PL) || (G2_14PL == 0)
#define  MG2_2_114PL    ~(1 << 13)
#else
#define  MG2_2_114PL    0xFFFF
#endif

#if (G2_15PL >= G2_2PL) || (G2_15PL == 0)
#define  MG2_2_115PL    ~(1 << 14)
#else
#define  MG2_2_115PL    0xFFFF
#endif

#if (G2_16PL >= G2_2PL) || (G2_16PL == 0)
#define  MG2_2_116PL    ~(1 << 15)
#else
#define  MG2_2_116PL    0xFFFF
#endif

#define  MG2_2_12PL	0xFFFD
#define  MG2_2    (MG2_2_11PL & MG2_2_12PL & MG2_2_13PL & MG2_2_14PL & \
                    MG2_2_15PL & MG2_2_16PL & MG2_2_17PL & MG2_2_18PL & \
                    MG2_2_19PL & MG2_2_110PL & MG2_2_111PL & MG2_2_112PL & \
                    MG2_2_113PL & MG2_2_114PL & MG2_2_115PL & MG2_2_116PL)
// End of MG2_2:
// Beginning of MG23:
#if (G2_1PL >= G2_3PL) || (G2_1PL == 0)
#define  MG2_3_11PL    ~(1 << 0)
#else
#define  MG2_3_11PL    0xFFFF
#endif

#if (G2_2PL >= G2_3PL) || (G2_2PL == 0)
#define  MG2_3_12PL    ~(1 << 1)
#else
#define  MG2_3_12PL    0xFFFF
#endif

#if (G2_4PL >= G2_3PL) || (G2_4PL == 0)
#define  MG2_3_14PL    ~(1 << 3)
#else
#define  MG2_3_14PL    0xFFFF
#endif

#if (G2_5PL >= G2_3PL) || (G2_5PL == 0)
#define  MG2_3_15PL    ~(1 << 4)
#else
#define  MG2_3_15PL    0xFFFF
#endif

#if (G2_6PL >= G2_3PL) || (G2_6PL == 0)
#define  MG2_3_16PL    ~(1 << 5)
#else
#define  MG2_3_16PL    0xFFFF
#endif

#if (G2_7PL >= G2_3PL) || (G2_7PL == 0)
#define  MG2_3_17PL    ~(1 << 6)
#else
#define  MG2_3_17PL    0xFFFF
#endif

#if (G2_8PL >= G2_3PL) || (G2_8PL == 0)
#define  MG2_3_18PL    ~(1 << 7)
#else
#define  MG2_3_18PL    0xFFFF
#endif

#if (G2_9PL >= G2_3PL) || (G2_9PL == 0)
#define  MG2_3_19PL    ~(1 << 8)
#else
#define  MG2_3_19PL    0xFFFF
#endif

#if (G2_10PL >= G2_3PL) || (G2_10PL == 0)
#define  MG2_3_110PL    ~(1 << 9)
#else
#define  MG2_3_110PL    0xFFFF
#endif

#if (G2_11PL >= G2_3PL) || (G2_11PL == 0)
#define  MG2_3_111PL    ~(1 << 10)
#else
#define  MG2_3_111PL    0xFFFF
#endif

#if (G2_12PL >= G2_3PL) || (G2_12PL == 0)
#define  MG2_3_112PL    ~(1 << 11)
#else
#define  MG2_3_112PL    0xFFFF
#endif

