dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2837xd/examples/cpu1/boostxl_afe031_f28379d_dacmode/cpu01/boostxl_afe031_f28379d_dacmode_isr.h
#if (G3_13PL >= G3_9PL) || (G3_13PL == 0)
#define  MG3_9_113PL    ~(1 << 12)
#else
#define  MG3_9_113PL    0xFFFF
#endif

#if (G3_14PL >= G3_9PL) || (G3_14PL == 0)
#define  MG3_9_114PL    ~(1 << 13)
#else
#define  MG3_9_114PL    0xFFFF
#endif

#if (G3_15PL >= G3_9PL) || (G3_15PL == 0)
#define  MG3_9_115PL    ~(1 << 14)
#else
#define  MG3_9_115PL    0xFFFF
#endif

#if (G3_16PL >= G3_9PL) || (G3_16PL == 0)
#define  MG3_9_116PL    ~(1 << 15)
#else
#define  MG3_9_116PL    0xFFFF
#endif

#define  MG3_9_19PL	0xFEFF
#define  MG3_9    (MG3_9_11PL & MG3_9_12PL & MG3_9_13PL & MG3_9_14PL & \
                    MG3_9_15PL & MG3_9_16PL & MG3_9_17PL & MG3_9_18PL & \
                    MG3_9_19PL & MG3_9_110PL & MG3_9_111PL & MG3_9_112PL & \
                    MG3_9_113PL & MG3_9_114PL & MG3_9_115PL & MG3_9_116PL)
// End of MG3_9:
// Beginning of MG310:
#if (G3_1PL >= G3_10PL) || (G3_1PL == 0)
#define  MG3_10_11PL    ~(1 << 0)
#else
#define  MG3_10_11PL    0xFFFF
#endif

#if (G3_2PL >= G3_10PL) || (G3_2PL == 0)
#define  MG3_10_12PL    ~(1 << 1)
#else
#define  MG3_10_12PL    0xFFFF
#endif

#if (G3_3PL >= G3_10PL) || (G3_3PL == 0)
#define  MG3_10_13PL    ~(1 << 2)
#else
#define  MG3_10_13PL    0xFFFF
#endif

#if (G3_4PL >= G3_10PL) || (G3_4PL == 0)
#define  MG3_10_14PL    ~(1 << 3)
#else
#define  MG3_10_14PL    0xFFFF
#endif

#if (G3_5PL >= G3_10PL) || (G3_5PL == 0)
#define  MG3_10_15PL    ~(1 << 4)
#else
#define  MG3_10_15PL    0xFFFF
#endif

#if (G3_6PL >= G3_10PL) || (G3_6PL == 0)
#define  MG3_10_16PL    ~(1 << 5)
#else
#define  MG3_10_16PL    0xFFFF
#endif

#if (G3_7PL >= G3_10PL) || (G3_7PL == 0)
#define  MG3_10_17PL    ~(1 << 6)
#else
#define  MG3_10_17PL    0xFFFF
#endif

#if (G3_8PL >= G3_10PL) || (G3_8PL == 0)
#define  MG3_10_18PL    ~(1 << 7)
#else
#define  MG3_10_18PL    0xFFFF
#endif

#if (G3_9PL >= G3_10PL) || (G3_9PL == 0)
#define  MG3_10_19PL    ~(1 << 8)
#else
#define  MG3_10_19PL    0xFFFF
#endif

#if (G3_11PL >= G3_10PL) || (G3_11PL == 0)
#define  MG3_10_111PL    ~(1 << 10)
#else
#define  MG3_10_111PL    0xFFFF
#endif

#if (G3_12PL >= G3_10PL) || (G3_12PL == 0)
#define  MG3_10_112PL    ~(1 << 11)
#else
#define  MG3_10_112PL    0xFFFF
#endif

#if (G3_13PL >= G3_10PL) || (G3_13PL == 0)
#define  MG3_10_113PL    ~(1 << 12)
#else
#define  MG3_10_113PL    0xFFFF
#endif

#if (G3_14PL >= G3_10PL) || (G3_14PL == 0)
#define  MG3_10_114PL    ~(1 << 13)
#else
#define  MG3_10_114PL    0xFFFF
#endif

#if (G3_15PL >= G3_10PL) || (G3_15PL == 0)
#define  MG3_10_115PL    ~(1 << 14)
#else
#define  MG3_10_115PL    0xFFFF
#endif

#if (G3_16PL >= G3_10PL) || (G3_16PL == 0)
#define  MG3_10_116PL    ~(1 << 15)
#else
#define  MG3_10_116PL    0xFFFF
#endif

#define  MG3_10_110PL	0xFDFF
#define  MG3_10    (MG3_10_11PL & MG3_10_12PL & MG3_10_13PL & MG3_10_14PL & \
                    MG3_10_15PL & MG3_10_16PL & MG3_10_17PL & MG3_10_18PL & \
                    MG3_10_19PL & MG3_10_110PL & MG3_10_111PL & MG3_10_112PL & \
                    MG3_10_113PL & MG3_10_114PL & MG3_10_115PL & MG3_10_116PL)
// End of MG3_10:
// Beginning of MG311:
#if (G3_1PL >= G3_11PL) || (G3_1PL == 0)
#define  MG3_11_11PL    ~(1 << 0)
#else
#define  MG3_11_11PL    0xFFFF
#endif

#if (G3_2PL >= G3_11PL) || (G3_2PL == 0)
#define  MG3_11_12PL    ~(1 << 1)
#else
#define  MG3_11_12PL    0xFFFF
#endif

#if (G3_3PL >= G3_11PL) || (G3_3PL == 0)
#define  MG3_11_13PL    ~(1 << 2)
#else
#define  MG3_11_13PL    0xFFFF
#endif

#if (G3_4PL >= G3_11PL) || (G3_4PL == 0)
#define  MG3_11_14PL    ~(1 << 3)
#else
#define  MG3_11_14PL    0xFFFF
#endif

#if (G3_5PL >= G3_11PL) || (G3_5PL == 0)
#define  MG3_11_15PL    ~(1 << 4)
#else
#define  MG3_11_15PL    0xFFFF
#endif

#if (G3_6PL >= G3_11PL) || (G3_6PL == 0)
#define  MG3_11_16PL    ~(1 << 5)
#else
#define  MG3_11_16PL    0xFFFF
#endif

#if (G3_7PL >= G3_11PL) || (G3_7PL == 0)
#define  MG3_11_17PL    ~(1 << 6)
#else
#define  MG3_11_17PL    0xFFFF
#endif

#if (G3_8PL >= G3_11PL) || (G3_8PL == 0)
#define  MG3_11_18PL    ~(1 << 7)
#else
#define  MG3_11_18PL    0xFFFF
#endif

#if (G3_9PL >= G3_11PL) || (G3_9PL == 0)
#define  MG3_11_19PL    ~(1 << 8)
#else
#define  MG3_11_19PL    0xFFFF
#endif

#if (G3_10PL >= G3_11PL) || (G3_10PL == 0)
#define  MG3_11_110PL    ~(1 << 9)
#else
#define  MG3_11_110PL    0xFFFF
#endif

#if (G3_12PL >= G3_11PL) || (G3_12PL == 0)
#define  MG3_11_112PL    ~(1 << 11)
#else
#define  MG3_11_112PL    0xFFFF
#endif

#if (G3_13PL >= G3_11PL) || (G3_13PL == 0)
#define  MG3_11_113PL    ~(1 << 12)
#else
#define  MG3_11_113PL    0xFFFF
#endif

#if (G3_14PL >= G3_11PL) || (G3_14PL == 0)
#define  MG3_11_114PL    ~(1 << 13)
#else
#define  MG3_11_114PL    0xFFFF
#endif

#if (G3_15PL >= G3_11PL) || (G3_15PL == 0)
#define  MG3_11_115PL    ~(1 << 14)
#else
#define  MG3_11_115PL    0xFFFF
#endif

#if (G3_16PL >= G3_11PL) || (G3_16PL == 0)
#define  MG3_11_116PL    ~(1 << 15)
#else
#define  MG3_11_116PL    0xFFFF
#endif

#define  MG3_11_111PL	0xFBFF
#define  MG3_11    (MG3_11_11PL & MG3_11_12PL & MG3_11_13PL & MG3_11_14PL & \
                    MG3_11_15PL & MG3_11_16PL & MG3_11_17PL & MG3_11_18PL & \
                    MG3_11_19PL & MG3_11_110PL & MG3_11_111PL & MG3_11_112PL & \
                    MG3_11_113PL & MG3_11_114PL & MG3_11_115PL & MG3_11_116PL)
// End of MG3_11:
// Beginning of MG312:
#if (G3_1PL >= G3_12PL) || (G3_1PL == 0)
#define  MG3_12_11PL    ~(1 << 0)
#else
#define  MG3_12_11PL    0xFFFF
#endif

#if (G3_2PL >= G3_12PL) || (G3_2PL == 0)
#define  MG3_12_12PL    ~(1 << 1)
#else
#define  MG3_12_12PL    0xFFFF
#endif

#if (G3_3PL >= G3_12PL) || (G3_3PL == 0)
#define  MG3_12_13PL    ~(1 << 2)
#else
#define  MG3_12_13PL    0xFFFF
#endif

#if (G3_4PL >= G3_12PL) || (G3_4PL == 0)
#define  MG3_12_14PL    ~(1 << 3)
#else
#define  MG3_12_14PL    0xFFFF
#endif

#if (G3_5PL >= G3_12PL) || (G3_5PL == 0)
#define  MG3_12_15PL    ~(1 << 4)
#else
#define  MG3_12_15PL    0xFFFF
#endif

#if (G3_6PL >= G3_12PL) || (G3_6PL == 0)
#define  MG3_12_16PL    ~(1 << 5)
#else
#define  MG3_12_16PL    0xFFFF
#endif

#if (G3_7PL >= G3_12PL) || (G3_7PL == 0)
#define  MG3_12_17PL    ~(1 << 6)
#else
#define  MG3_12_17PL    0xFFFF
#endif

#if (G3_8PL >= G3_12PL) || (G3_8PL == 0)
#define  MG3_12_18PL    ~(1 << 7)
#else
#define  MG3_12_18PL    0xFFFF
#endif

#if (G3_9PL >= G3_12PL) || (G3_9PL == 0)
#define  MG3_12_19PL    ~(1 << 8)
#else
#define  MG3_12_19PL    0xFFFF
#endif

#if (G3_10PL >= G3_12PL) || (G3_10PL == 0)
#define  MG3_12_110PL    ~(1 << 9)
#else
#define  MG3_12_110PL    0xFFFF
#endif

#if (G3_11PL >= G3_12PL) || (G3_11PL == 0)
#define  MG3_12_111PL    ~(1 << 10)
#else
#define  MG3_12_111PL    0xFFFF
#endif

#if (G3_13PL >= G3_12PL) || (G3_13PL == 0)
#define  MG3_12_113PL    ~(1 << 12)
#else
#define  MG3_12_113PL    0xFFFF
#endif

#if (G3_14PL >= G3_12PL) || (G3_14PL == 0)
#define  MG3_12_114PL    ~(1 << 13)
#else
#define  MG3_12_114PL    0xFFFF
#endif

#if (G3_15PL >= G3_12PL) || (G3_15PL == 0)
#define  MG3_12_115PL    ~(1 << 14)
#else
#define  MG3_12_115PL    0xFFFF
#endif

#if (G3_16PL >= G3_12PL) || (G3_16PL == 0)
#define  MG3_12_116PL    ~(1 << 15)
#else
#define  MG3_12_116PL    0xFFFF
#endif

#define  MG3_12_112PL	0xF7FF
#define  MG3_12    (MG3_12_11PL & MG3_12_12PL & MG3_12_13PL & MG3_12_14PL & \
                    MG3_12_15PL & MG3_12_16PL & MG3_12_17PL & MG3_12_18PL & \
                    MG3_12_19PL & MG3_12_110PL & MG3_12_111PL & MG3_12_112PL & \
                    MG3_12_113PL & MG3_12_114PL & MG3_12_115PL & MG3_12_116PL)
// End of MG3_12:
// Beginning of MG313:
#if (G3_1PL >= G3_13PL) || (G3_1PL == 0)
#define  MG3_13_11PL    ~(1 << 0)
#else
#define  MG3_13_11PL    0xFFFF
#endif

#if (G3_2PL >= G3_13PL) || (G3_2PL == 0)
#define  MG3_13_12PL    ~(1 << 1)
#else
#define  MG3_13_12PL    0xFFFF
#endif

#if (G3_3PL >= G3_13PL) || (G3_3PL == 0)
#define  MG3_13_13PL    ~(1 << 2)
#else
#define  MG3_13_13PL    0xFFFF
#endif

#if (G3_4PL >= G3_13PL) || (G3_4PL == 0)
#define  MG3_13_14PL    ~(1 << 3)
#else
#define  MG3_13_14PL    0xFFFF
#endif

#if (G3_5PL >= G3_13PL) || (G3_5PL == 0)
#define  MG3_13_15PL    ~(1 << 4)
#else
#define  MG3_13_15PL    0xFFFF
#endif

