dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2837xd/examples/cpu1/boostxl_afe031_f28379d_dacmode/cpu01/boostxl_afe031_f28379d_dacmode_isr.h
#if (G4_6PL >= G4_15PL) || (G4_6PL == 0)
#define  MG4_15_16PL    ~(1 << 5)
#else
#define  MG4_15_16PL    0xFFFF
#endif

#if (G4_7PL >= G4_15PL) || (G4_7PL == 0)
#define  MG4_15_17PL    ~(1 << 6)
#else
#define  MG4_15_17PL    0xFFFF
#endif

#if (G4_8PL >= G4_15PL) || (G4_8PL == 0)
#define  MG4_15_18PL    ~(1 << 7)
#else
#define  MG4_15_18PL    0xFFFF
#endif

#if (G4_9PL >= G4_15PL) || (G4_9PL == 0)
#define  MG4_15_19PL    ~(1 << 8)
#else
#define  MG4_15_19PL    0xFFFF
#endif

#if (G4_10PL >= G4_15PL) || (G4_10PL == 0)
#define  MG4_15_110PL    ~(1 << 9)
#else
#define  MG4_15_110PL    0xFFFF
#endif

#if (G4_11PL >= G4_15PL) || (G4_11PL == 0)
#define  MG4_15_111PL    ~(1 << 10)
#else
#define  MG4_15_111PL    0xFFFF
#endif

#if (G4_12PL >= G4_15PL) || (G4_12PL == 0)
#define  MG4_15_112PL    ~(1 << 11)
#else
#define  MG4_15_112PL    0xFFFF
#endif

#if (G4_13PL >= G4_15PL) || (G4_13PL == 0)
#define  MG4_15_113PL    ~(1 << 12)
#else
#define  MG4_15_113PL    0xFFFF
#endif

#if (G4_14PL >= G4_15PL) || (G4_14PL == 0)
#define  MG4_15_114PL    ~(1 << 13)
#else
#define  MG4_15_114PL    0xFFFF
#endif

#if (G4_16PL >= G4_15PL) || (G4_16PL == 0)
#define  MG4_15_116PL    ~(1 << 15)
#else
#define  MG4_15_116PL    0xFFFF
#endif

#define  MG4_15_115PL	0xBFFF
#define  MG4_15    (MG4_15_11PL & MG4_15_12PL & MG4_15_13PL & MG4_15_14PL & \
                    MG4_15_15PL & MG4_15_16PL & MG4_15_17PL & MG4_15_18PL & \
                    MG4_15_19PL & MG4_15_110PL & MG4_15_111PL & MG4_15_112PL & \
                    MG4_15_113PL & MG4_15_114PL & MG4_15_115PL & MG4_15_116PL)
// End of MG4_15:
// Beginning of MG416:
#if (G4_1PL >= G4_16PL) || (G4_1PL == 0)
#define  MG4_16_11PL    ~(1 << 0)
#else
#define  MG4_16_11PL    0xFFFF
#endif

#if (G4_2PL >= G4_16PL) || (G4_2PL == 0)
#define  MG4_16_12PL    ~(1 << 1)
#else
#define  MG4_16_12PL    0xFFFF
#endif

#if (G4_3PL >= G4_16PL) || (G4_3PL == 0)
#define  MG4_16_13PL    ~(1 << 2)
#else
#define  MG4_16_13PL    0xFFFF
#endif

#if (G4_4PL >= G4_16PL) || (G4_4PL == 0)
#define  MG4_16_14PL    ~(1 << 3)
#else
#define  MG4_16_14PL    0xFFFF
#endif

#if (G4_5PL >= G4_16PL) || (G4_5PL == 0)
#define  MG4_16_15PL    ~(1 << 4)
#else
#define  MG4_16_15PL    0xFFFF
#endif

#if (G4_6PL >= G4_16PL) || (G4_6PL == 0)
#define  MG4_16_16PL    ~(1 << 5)
#else
#define  MG4_16_16PL    0xFFFF
#endif

#if (G4_7PL >= G4_16PL) || (G4_7PL == 0)
#define  MG4_16_17PL    ~(1 << 6)
#else
#define  MG4_16_17PL    0xFFFF
#endif

#if (G4_8PL >= G4_16PL) || (G4_8PL == 0)
#define  MG4_16_18PL    ~(1 << 7)
#else
#define  MG4_16_18PL    0xFFFF
#endif

#if (G4_9PL >= G4_16PL) || (G4_9PL == 0)
#define  MG4_16_19PL    ~(1 << 8)
#else
#define  MG4_16_19PL    0xFFFF
#endif

#if (G4_10PL >= G4_16PL) || (G4_10PL == 0)
#define  MG4_16_110PL    ~(1 << 9)
#else
#define  MG4_16_110PL    0xFFFF
#endif

#if (G4_11PL >= G4_16PL) || (G4_11PL == 0)
#define  MG4_16_111PL    ~(1 << 10)
#else
#define  MG4_16_111PL    0xFFFF
#endif

#if (G4_12PL >= G4_16PL) || (G4_12PL == 0)
#define  MG4_16_112PL    ~(1 << 11)
#else
#define  MG4_16_112PL    0xFFFF
#endif

#if (G4_13PL >= G4_16PL) || (G4_13PL == 0)
#define  MG4_16_113PL    ~(1 << 12)
#else
#define  MG4_16_113PL    0xFFFF
#endif

#if (G4_14PL >= G4_16PL) || (G4_14PL == 0)
#define  MG4_16_114PL    ~(1 << 13)
#else
#define  MG4_16_114PL    0xFFFF
#endif

#if (G4_15PL >= G4_16PL) || (G4_15PL == 0)
#define  MG4_16_115PL    ~(1 << 14)
#else
#define  MG4_16_115PL    0xFFFF
#endif

#define  MG4_16_116PL	0x7FFF
#define  MG4_16    (MG4_16_11PL & MG4_16_12PL & MG4_16_13PL & MG4_16_14PL & \
                    MG4_16_15PL & MG4_16_16PL & MG4_16_17PL & MG4_16_18PL & \
                    MG4_16_19PL & MG4_16_110PL & MG4_16_111PL & MG4_16_112PL & \
                    MG4_16_113PL & MG4_16_114PL & MG4_16_115PL & MG4_16_116PL)
// End of MG4_16:


//
// Automatically generate PIEIER5 interrupt masks MG51 to MG516:
//

// Beginning of MG51:
#if (G5_2PL >= G5_1PL) || (G5_2PL == 0)
#define  MG5_1_12PL    ~(1 << 1)
#else
#define  MG5_1_12PL    0xFFFF
#endif

#if (G5_3PL >= G5_1PL) || (G5_3PL == 0)
#define  MG5_1_13PL    ~(1 << 2)
#else
#define  MG5_1_13PL    0xFFFF
#endif

#if (G5_4PL >= G5_1PL) || (G5_4PL == 0)
#define  MG5_1_14PL    ~(1 << 3)
#else
#define  MG5_1_14PL    0xFFFF
#endif

#if (G5_5PL >= G5_1PL) || (G5_5PL == 0)
#define  MG5_1_15PL    ~(1 << 4)
#else
#define  MG5_1_15PL    0xFFFF
#endif

#if (G5_6PL >= G5_1PL) || (G5_6PL == 0)
#define  MG5_1_16PL    ~(1 << 5)
#else
#define  MG5_1_16PL    0xFFFF
#endif

#if (G5_7PL >= G5_1PL) || (G5_7PL == 0)
#define  MG5_1_17PL    ~(1 << 6)
#else
#define  MG5_1_17PL    0xFFFF
#endif

#if (G5_8PL >= G5_1PL) || (G5_8PL == 0)
#define  MG5_1_18PL    ~(1 << 7)
#else
#define  MG5_1_18PL    0xFFFF
#endif

#if (G5_9PL >= G5_1PL) || (G5_9PL == 0)
#define  MG5_1_19PL    ~(1 << 8)
#else
#define  MG5_1_19PL    0xFFFF
#endif

#if (G5_10PL >= G5_1PL) || (G5_10PL == 0)
#define  MG5_1_110PL    ~(1 << 9)
#else
#define  MG5_1_110PL    0xFFFF
#endif

#if (G5_11PL >= G5_1PL) || (G5_11PL == 0)
#define  MG5_1_111PL    ~(1 << 10)
#else
#define  MG5_1_111PL    0xFFFF
#endif

#if (G5_12PL >= G5_1PL) || (G5_12PL == 0)
#define  MG5_1_112PL    ~(1 << 11)
#else
#define  MG5_1_112PL    0xFFFF
#endif

#if (G5_13PL >= G5_1PL) || (G5_13PL == 0)
#define  MG5_1_113PL    ~(1 << 12)
#else
#define  MG5_1_113PL    0xFFFF
#endif

#if (G5_14PL >= G5_1PL) || (G5_14PL == 0)
#define  MG5_1_114PL    ~(1 << 13)
#else
#define  MG5_1_114PL    0xFFFF
#endif

#if (G5_15PL >= G5_1PL) || (G5_15PL == 0)
#define  MG5_1_115PL    ~(1 << 14)
#else
#define  MG5_1_115PL    0xFFFF
#endif

#if (G5_16PL >= G5_1PL) || (G5_16PL == 0)
#define  MG5_1_116PL    ~(1 << 15)
#else
#define  MG5_1_116PL    0xFFFF
#endif

#define  MG5_1_11PL	0xFFFE
#define  MG5_1    (MG5_1_11PL & MG5_1_12PL & MG5_1_13PL & MG5_1_14PL & \
                    MG5_1_15PL & MG5_1_16PL & MG5_1_17PL & MG5_1_18PL & \
                    MG5_1_19PL & MG5_1_110PL & MG5_1_111PL & MG5_1_112PL & \
                    MG5_1_113PL & MG5_1_114PL & MG5_1_115PL & MG5_1_116PL)
// End of MG5_1:
// Beginning of MG52:
#if (G5_1PL >= G5_2PL) || (G5_1PL == 0)
#define  MG5_2_11PL    ~(1 << 0)
#else
#define  MG5_2_11PL    0xFFFF
#endif

#if (G5_3PL >= G5_2PL) || (G5_3PL == 0)
#define  MG5_2_13PL    ~(1 << 2)
#else
#define  MG5_2_13PL    0xFFFF
#endif

#if (G5_4PL >= G5_2PL) || (G5_4PL == 0)
#define  MG5_2_14PL    ~(1 << 3)
#else
#define  MG5_2_14PL    0xFFFF
#endif

#if (G5_5PL >= G5_2PL) || (G5_5PL == 0)
#define  MG5_2_15PL    ~(1 << 4)
#else
#define  MG5_2_15PL    0xFFFF
#endif

#if (G5_6PL >= G5_2PL) || (G5_6PL == 0)
#define  MG5_2_16PL    ~(1 << 5)
#else
#define  MG5_2_16PL    0xFFFF
#endif

#if (G5_7PL >= G5_2PL) || (G5_7PL == 0)
#define  MG5_2_17PL    ~(1 << 6)
#else
#define  MG5_2_17PL    0xFFFF
#endif

#if (G5_8PL >= G5_2PL) || (G5_8PL == 0)
#define  MG5_2_18PL    ~(1 << 7)
#else
#define  MG5_2_18PL    0xFFFF
#endif

#if (G5_9PL >= G5_2PL) || (G5_9PL == 0)
#define  MG5_2_19PL    ~(1 << 8)
#else
#define  MG5_2_19PL    0xFFFF
#endif

#if (G5_10PL >= G5_2PL) || (G5_10PL == 0)
#define  MG5_2_110PL    ~(1 << 9)
#else
#define  MG5_2_110PL    0xFFFF
#endif

