dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2837xd/examples/cpu1/boostxl_afe031_f28379d_dacmode/cpu01/boostxl_afe031_f28379d_dacmode_isr.h
#if (G7_10PL >= G7_4PL) || (G7_10PL == 0)
#define  MG7_4_110PL    ~(1 << 9)
#else
#define  MG7_4_110PL    0xFFFF
#endif

#if (G7_11PL >= G7_4PL) || (G7_11PL == 0)
#define  MG7_4_111PL    ~(1 << 10)
#else
#define  MG7_4_111PL    0xFFFF
#endif

#if (G7_12PL >= G7_4PL) || (G7_12PL == 0)
#define  MG7_4_112PL    ~(1 << 11)
#else
#define  MG7_4_112PL    0xFFFF
#endif

#if (G7_13PL >= G7_4PL) || (G7_13PL == 0)
#define  MG7_4_113PL    ~(1 << 12)
#else
#define  MG7_4_113PL    0xFFFF
#endif

#if (G7_14PL >= G7_4PL) || (G7_14PL == 0)
#define  MG7_4_114PL    ~(1 << 13)
#else
#define  MG7_4_114PL    0xFFFF
#endif

#if (G7_15PL >= G7_4PL) || (G7_15PL == 0)
#define  MG7_4_115PL    ~(1 << 14)
#else
#define  MG7_4_115PL    0xFFFF
#endif

#if (G7_16PL >= G7_4PL) || (G7_16PL == 0)
#define  MG7_4_116PL    ~(1 << 15)
#else
#define  MG7_4_116PL    0xFFFF
#endif

#define  MG7_4_14PL	0xFFF7
#define  MG7_4    (MG7_4_11PL & MG7_4_12PL & MG7_4_13PL & MG7_4_14PL & \
                    MG7_4_15PL & MG7_4_16PL & MG7_4_17PL & MG7_4_18PL & \
                    MG7_4_19PL & MG7_4_110PL & MG7_4_111PL & MG7_4_112PL & \
                    MG7_4_113PL & MG7_4_114PL & MG7_4_115PL & MG7_4_116PL)
// End of MG7_4:
// Beginning of MG75:
#if (G7_1PL >= G7_5PL) || (G7_1PL == 0)
#define  MG7_5_11PL    ~(1 << 0)
#else
#define  MG7_5_11PL    0xFFFF
#endif

#if (G7_2PL >= G7_5PL) || (G7_2PL == 0)
#define  MG7_5_12PL    ~(1 << 1)
#else
#define  MG7_5_12PL    0xFFFF
#endif

#if (G7_3PL >= G7_5PL) || (G7_3PL == 0)
#define  MG7_5_13PL    ~(1 << 2)
#else
#define  MG7_5_13PL    0xFFFF
#endif

#if (G7_4PL >= G7_5PL) || (G7_4PL == 0)
#define  MG7_5_14PL    ~(1 << 3)
#else
#define  MG7_5_14PL    0xFFFF
#endif

#if (G7_6PL >= G7_5PL) || (G7_6PL == 0)
#define  MG7_5_16PL    ~(1 << 5)
#else
#define  MG7_5_16PL    0xFFFF
#endif

#if (G7_7PL >= G7_5PL) || (G7_7PL == 0)
#define  MG7_5_17PL    ~(1 << 6)
#else
#define  MG7_5_17PL    0xFFFF
#endif

#if (G7_8PL >= G7_5PL) || (G7_8PL == 0)
#define  MG7_5_18PL    ~(1 << 7)
#else
#define  MG7_5_18PL    0xFFFF
#endif

#if (G7_9PL >= G7_5PL) || (G7_9PL == 0)
#define  MG7_5_19PL    ~(1 << 8)
#else
#define  MG7_5_19PL    0xFFFF
#endif

#if (G7_10PL >= G7_5PL) || (G7_10PL == 0)
#define  MG7_5_110PL    ~(1 << 9)
#else
#define  MG7_5_110PL    0xFFFF
#endif

#if (G7_11PL >= G7_5PL) || (G7_11PL == 0)
#define  MG7_5_111PL    ~(1 << 10)
#else
#define  MG7_5_111PL    0xFFFF
#endif

#if (G7_12PL >= G7_5PL) || (G7_12PL == 0)
#define  MG7_5_112PL    ~(1 << 11)
#else
#define  MG7_5_112PL    0xFFFF
#endif

#if (G7_13PL >= G7_5PL) || (G7_13PL == 0)
#define  MG7_5_113PL    ~(1 << 12)
#else
#define  MG7_5_113PL    0xFFFF
#endif

#if (G7_14PL >= G7_5PL) || (G7_14PL == 0)
#define  MG7_5_114PL    ~(1 << 13)
#else
#define  MG7_5_114PL    0xFFFF
#endif

#if (G7_15PL >= G7_5PL) || (G7_15PL == 0)
#define  MG7_5_115PL    ~(1 << 14)
#else
#define  MG7_5_115PL    0xFFFF
#endif

#if (G7_16PL >= G7_5PL) || (G7_16PL == 0)
#define  MG7_5_116PL    ~(1 << 15)
#else
#define  MG7_5_116PL    0xFFFF
#endif

#define  MG7_5_15PL	0xFFEF
#define  MG7_5    (MG7_5_11PL & MG7_5_12PL & MG7_5_13PL & MG7_5_14PL & \
                    MG7_5_15PL & MG7_5_16PL & MG7_5_17PL & MG7_5_18PL & \
                    MG7_5_19PL & MG7_5_110PL & MG7_5_111PL & MG7_5_112PL & \
                    MG7_5_113PL & MG7_5_114PL & MG7_5_115PL & MG7_5_116PL)
// End of MG7_5:
// Beginning of MG76:
#if (G7_1PL >= G7_6PL) || (G7_1PL == 0)
#define  MG7_6_11PL    ~(1 << 0)
#else
#define  MG7_6_11PL    0xFFFF
#endif

#if (G7_2PL >= G7_6PL) || (G7_2PL == 0)
#define  MG7_6_12PL    ~(1 << 1)
#else
#define  MG7_6_12PL    0xFFFF
#endif

#if (G7_3PL >= G7_6PL) || (G7_3PL == 0)
#define  MG7_6_13PL    ~(1 << 2)
#else
#define  MG7_6_13PL    0xFFFF
#endif

#if (G7_4PL >= G7_6PL) || (G7_4PL == 0)
#define  MG7_6_14PL    ~(1 << 3)
#else
#define  MG7_6_14PL    0xFFFF
#endif

#if (G7_5PL >= G7_6PL) || (G7_5PL == 0)
#define  MG7_6_15PL    ~(1 << 4)
#else
#define  MG7_6_15PL    0xFFFF
#endif

#if (G7_7PL >= G7_6PL) || (G7_7PL == 0)
#define  MG7_6_17PL    ~(1 << 6)
#else
#define  MG7_6_17PL    0xFFFF
#endif

#if (G7_8PL >= G7_6PL) || (G7_8PL == 0)
#define  MG7_6_18PL    ~(1 << 7)
#else
#define  MG7_6_18PL    0xFFFF
#endif

#if (G7_9PL >= G7_6PL) || (G7_9PL == 0)
#define  MG7_6_19PL    ~(1 << 8)
#else
#define  MG7_6_19PL    0xFFFF
#endif

#if (G7_10PL >= G7_6PL) || (G7_10PL == 0)
#define  MG7_6_110PL    ~(1 << 9)
#else
#define  MG7_6_110PL    0xFFFF
#endif

#if (G7_11PL >= G7_6PL) || (G7_11PL == 0)
#define  MG7_6_111PL    ~(1 << 10)
#else
#define  MG7_6_111PL    0xFFFF
#endif

#if (G7_12PL >= G7_6PL) || (G7_12PL == 0)
#define  MG7_6_112PL    ~(1 << 11)
#else
#define  MG7_6_112PL    0xFFFF
#endif

#if (G7_13PL >= G7_6PL) || (G7_13PL == 0)
#define  MG7_6_113PL    ~(1 << 12)
#else
#define  MG7_6_113PL    0xFFFF
#endif

#if (G7_14PL >= G7_6PL) || (G7_14PL == 0)
#define  MG7_6_114PL    ~(1 << 13)
#else
#define  MG7_6_114PL    0xFFFF
#endif

#if (G7_15PL >= G7_6PL) || (G7_15PL == 0)
#define  MG7_6_115PL    ~(1 << 14)
#else
#define  MG7_6_115PL    0xFFFF
#endif

#if (G7_16PL >= G7_6PL) || (G7_16PL == 0)
#define  MG7_6_116PL    ~(1 << 15)
#else
#define  MG7_6_116PL    0xFFFF
#endif

#define  MG7_6_16PL	0xFFDF
#define  MG7_6    (MG7_6_11PL & MG7_6_12PL & MG7_6_13PL & MG7_6_14PL & \
                    MG7_6_15PL & MG7_6_16PL & MG7_6_17PL & MG7_6_18PL & \
                    MG7_6_19PL & MG7_6_110PL & MG7_6_111PL & MG7_6_112PL & \
                    MG7_6_113PL & MG7_6_114PL & MG7_6_115PL & MG7_6_116PL)
// End of MG7_6:
// Beginning of MG77:
#if (G7_1PL >= G7_7PL) || (G7_1PL == 0)
#define  MG7_7_11PL    ~(1 << 0)
#else
#define  MG7_7_11PL    0xFFFF
#endif

#if (G7_2PL >= G7_7PL) || (G7_2PL == 0)
#define  MG7_7_12PL    ~(1 << 1)
#else
#define  MG7_7_12PL    0xFFFF
#endif

#if (G7_3PL >= G7_7PL) || (G7_3PL == 0)
#define  MG7_7_13PL    ~(1 << 2)
#else
#define  MG7_7_13PL    0xFFFF
#endif

#if (G7_4PL >= G7_7PL) || (G7_4PL == 0)
#define  MG7_7_14PL    ~(1 << 3)
#else
#define  MG7_7_14PL    0xFFFF
#endif

#if (G7_5PL >= G7_7PL) || (G7_5PL == 0)
#define  MG7_7_15PL    ~(1 << 4)
#else
#define  MG7_7_15PL    0xFFFF
#endif

