dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2837xd/examples/cpu1/boostxl_afe031_f28379d_dacmode/cpu01/boostxl_afe031_f28379d_dacmode_isr.h
#if (G7_6PL >= G7_7PL) || (G7_6PL == 0)
#define  MG7_7_16PL    ~(1 << 5)
#else
#define  MG7_7_16PL    0xFFFF
#endif

#if (G7_8PL >= G7_7PL) || (G7_8PL == 0)
#define  MG7_7_18PL    ~(1 << 7)
#else
#define  MG7_7_18PL    0xFFFF
#endif

#if (G7_9PL >= G7_7PL) || (G7_9PL == 0)
#define  MG7_7_19PL    ~(1 << 8)
#else
#define  MG7_7_19PL    0xFFFF
#endif

#if (G7_10PL >= G7_7PL) || (G7_10PL == 0)
#define  MG7_7_110PL    ~(1 << 9)
#else
#define  MG7_7_110PL    0xFFFF
#endif

#if (G7_11PL >= G7_7PL) || (G7_11PL == 0)
#define  MG7_7_111PL    ~(1 << 10)
#else
#define  MG7_7_111PL    0xFFFF
#endif

#if (G7_12PL >= G7_7PL) || (G7_12PL == 0)
#define  MG7_7_112PL    ~(1 << 11)
#else
#define  MG7_7_112PL    0xFFFF
#endif

#if (G7_13PL >= G7_7PL) || (G7_13PL == 0)
#define  MG7_7_113PL    ~(1 << 12)
#else
#define  MG7_7_113PL    0xFFFF
#endif

#if (G7_14PL >= G7_7PL) || (G7_14PL == 0)
#define  MG7_7_114PL    ~(1 << 13)
#else
#define  MG7_7_114PL    0xFFFF
#endif

#if (G7_15PL >= G7_7PL) || (G7_15PL == 0)
#define  MG7_7_115PL    ~(1 << 14)
#else
#define  MG7_7_115PL    0xFFFF
#endif

#if (G7_16PL >= G7_7PL) || (G7_16PL == 0)
#define  MG7_7_116PL    ~(1 << 15)
#else
#define  MG7_7_116PL    0xFFFF
#endif

#define  MG7_7_17PL	0xFFBF
#define  MG7_7    (MG7_7_11PL & MG7_7_12PL & MG7_7_13PL & MG7_7_14PL & \
                    MG7_7_15PL & MG7_7_16PL & MG7_7_17PL & MG7_7_18PL & \
                    MG7_7_19PL & MG7_7_110PL & MG7_7_111PL & MG7_7_112PL & \
                    MG7_7_113PL & MG7_7_114PL & MG7_7_115PL & MG7_7_116PL)
// End of MG7_7:
// Beginning of MG78:
#if (G7_1PL >= G7_8PL) || (G7_1PL == 0)
#define  MG7_8_11PL    ~(1 << 0)
#else
#define  MG7_8_11PL    0xFFFF
#endif

#if (G7_2PL >= G7_8PL) || (G7_2PL == 0)
#define  MG7_8_12PL    ~(1 << 1)
#else
#define  MG7_8_12PL    0xFFFF
#endif

#if (G7_3PL >= G7_8PL) || (G7_3PL == 0)
#define  MG7_8_13PL    ~(1 << 2)
#else
#define  MG7_8_13PL    0xFFFF
#endif

#if (G7_4PL >= G7_8PL) || (G7_4PL == 0)
#define  MG7_8_14PL    ~(1 << 3)
#else
#define  MG7_8_14PL    0xFFFF
#endif

#if (G7_5PL >= G7_8PL) || (G7_5PL == 0)
#define  MG7_8_15PL    ~(1 << 4)
#else
#define  MG7_8_15PL    0xFFFF
#endif

#if (G7_6PL >= G7_8PL) || (G7_6PL == 0)
#define  MG7_8_16PL    ~(1 << 5)
#else
#define  MG7_8_16PL    0xFFFF
#endif

#if (G7_7PL >= G7_8PL) || (G7_7PL == 0)
#define  MG7_8_17PL    ~(1 << 6)
#else
#define  MG7_8_17PL    0xFFFF
#endif

#if (G7_9PL >= G7_8PL) || (G7_9PL == 0)
#define  MG7_8_19PL    ~(1 << 8)
#else
#define  MG7_8_19PL    0xFFFF
#endif

#if (G7_10PL >= G7_8PL) || (G7_10PL == 0)
#define  MG7_8_110PL    ~(1 << 9)
#else
#define  MG7_8_110PL    0xFFFF
#endif

#if (G7_11PL >= G7_8PL) || (G7_11PL == 0)
#define  MG7_8_111PL    ~(1 << 10)
#else
#define  MG7_8_111PL    0xFFFF
#endif

#if (G7_12PL >= G7_8PL) || (G7_12PL == 0)
#define  MG7_8_112PL    ~(1 << 11)
#else
#define  MG7_8_112PL    0xFFFF
#endif

#if (G7_13PL >= G7_8PL) || (G7_13PL == 0)
#define  MG7_8_113PL    ~(1 << 12)
#else
#define  MG7_8_113PL    0xFFFF
#endif

#if (G7_14PL >= G7_8PL) || (G7_14PL == 0)
#define  MG7_8_114PL    ~(1 << 13)
#else
#define  MG7_8_114PL    0xFFFF
#endif

#if (G7_15PL >= G7_8PL) || (G7_15PL == 0)
#define  MG7_8_115PL    ~(1 << 14)
#else
#define  MG7_8_115PL    0xFFFF
#endif

#if (G7_16PL >= G7_8PL) || (G7_16PL == 0)
#define  MG7_8_116PL    ~(1 << 15)
#else
#define  MG7_8_116PL    0xFFFF
#endif

#define  MG7_8_18PL	0xFF7F
#define  MG7_8    (MG7_8_11PL & MG7_8_12PL & MG7_8_13PL & MG7_8_14PL & \
                    MG7_8_15PL & MG7_8_16PL & MG7_8_17PL & MG7_8_18PL & \
                    MG7_8_19PL & MG7_8_110PL & MG7_8_111PL & MG7_8_112PL & \
                    MG7_8_113PL & MG7_8_114PL & MG7_8_115PL & MG7_8_116PL)
// End of MG7_8:
// Beginning of MG79:
#if (G7_1PL >= G7_9PL) || (G7_1PL == 0)
#define  MG7_9_11PL    ~(1 << 0)
#else
#define  MG7_9_11PL    0xFFFF
#endif

#if (G7_2PL >= G7_9PL) || (G7_2PL == 0)
#define  MG7_9_12PL    ~(1 << 1)
#else
#define  MG7_9_12PL    0xFFFF
#endif

#if (G7_3PL >= G7_9PL) || (G7_3PL == 0)
#define  MG7_9_13PL    ~(1 << 2)
#else
#define  MG7_9_13PL    0xFFFF
#endif

#if (G7_4PL >= G7_9PL) || (G7_4PL == 0)
#define  MG7_9_14PL    ~(1 << 3)
#else
#define  MG7_9_14PL    0xFFFF
#endif

#if (G7_5PL >= G7_9PL) || (G7_5PL == 0)
#define  MG7_9_15PL    ~(1 << 4)
#else
#define  MG7_9_15PL    0xFFFF
#endif

#if (G7_6PL >= G7_9PL) || (G7_6PL == 0)
#define  MG7_9_16PL    ~(1 << 5)
#else
#define  MG7_9_16PL    0xFFFF
#endif

#if (G7_7PL >= G7_9PL) || (G7_7PL == 0)
#define  MG7_9_17PL    ~(1 << 6)
#else
#define  MG7_9_17PL    0xFFFF
#endif

#if (G7_8PL >= G7_9PL) || (G7_8PL == 0)
#define  MG7_9_18PL    ~(1 << 7)
#else
#define  MG7_9_18PL    0xFFFF
#endif

#if (G7_10PL >= G7_9PL) || (G7_10PL == 0)
#define  MG7_9_110PL    ~(1 << 9)
#else
#define  MG7_9_110PL    0xFFFF
#endif

#if (G7_11PL >= G7_9PL) || (G7_11PL == 0)
#define  MG7_9_111PL    ~(1 << 10)
#else
#define  MG7_9_111PL    0xFFFF
#endif

#if (G7_12PL >= G7_9PL) || (G7_12PL == 0)
#define  MG7_9_112PL    ~(1 << 11)
#else
#define  MG7_9_112PL    0xFFFF
#endif

#if (G7_13PL >= G7_9PL) || (G7_13PL == 0)
#define  MG7_9_113PL    ~(1 << 12)
#else
#define  MG7_9_113PL    0xFFFF
#endif

#if (G7_14PL >= G7_9PL) || (G7_14PL == 0)
#define  MG7_9_114PL    ~(1 << 13)
#else
#define  MG7_9_114PL    0xFFFF
#endif

#if (G7_15PL >= G7_9PL) || (G7_15PL == 0)
#define  MG7_9_115PL    ~(1 << 14)
#else
#define  MG7_9_115PL    0xFFFF
#endif

#if (G7_16PL >= G7_9PL) || (G7_16PL == 0)
#define  MG7_9_116PL    ~(1 << 15)
#else
#define  MG7_9_116PL    0xFFFF
#endif

#define  MG7_9_19PL	0xFEFF
#define  MG7_9    (MG7_9_11PL & MG7_9_12PL & MG7_9_13PL & MG7_9_14PL & \
                    MG7_9_15PL & MG7_9_16PL & MG7_9_17PL & MG7_9_18PL & \
                    MG7_9_19PL & MG7_9_110PL & MG7_9_111PL & MG7_9_112PL & \
                    MG7_9_113PL & MG7_9_114PL & MG7_9_115PL & MG7_9_116PL)
// End of MG7_9:
// Beginning of MG710:
#if (G7_1PL >= G7_10PL) || (G7_1PL == 0)
#define  MG7_10_11PL    ~(1 << 0)
#else
#define  MG7_10_11PL    0xFFFF
#endif

#if (G7_2PL >= G7_10PL) || (G7_2PL == 0)
#define  MG7_10_12PL    ~(1 << 1)
#else
#define  MG7_10_12PL    0xFFFF
#endif

#if (G7_3PL >= G7_10PL) || (G7_3PL == 0)
#define  MG7_10_13PL    ~(1 << 2)
#else
#define  MG7_10_13PL    0xFFFF
#endif

#if (G7_4PL >= G7_10PL) || (G7_4PL == 0)
#define  MG7_10_14PL    ~(1 << 3)
#else
#define  MG7_10_14PL    0xFFFF
#endif

