dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2837xd/examples/cpu1/boostxl_afe031_f28379d_dacmode/cpu01/boostxl_afe031_f28379d_dacmode_isr.h
#if (G10_9PL >= G10_12PL) || (G10_9PL == 0)
#define  MG10_12_19PL    ~(1 << 8)
#else
#define  MG10_12_19PL    0xFFFF
#endif

#if (G10_10PL >= G10_12PL) || (G10_10PL == 0)
#define  MG10_12_110PL    ~(1 << 9)
#else
#define  MG10_12_110PL    0xFFFF
#endif

#if (G10_11PL >= G10_12PL) || (G10_11PL == 0)
#define  MG10_12_111PL    ~(1 << 10)
#else
#define  MG10_12_111PL    0xFFFF
#endif

#if (G10_13PL >= G10_12PL) || (G10_13PL == 0)
#define  MG10_12_113PL    ~(1 << 12)
#else
#define  MG10_12_113PL    0xFFFF
#endif

#if (G10_14PL >= G10_12PL) || (G10_14PL == 0)
#define  MG10_12_114PL    ~(1 << 13)
#else
#define  MG10_12_114PL    0xFFFF
#endif

#if (G10_15PL >= G10_12PL) || (G10_15PL == 0)
#define  MG10_12_115PL    ~(1 << 14)
#else
#define  MG10_12_115PL    0xFFFF
#endif

#if (G10_16PL >= G10_12PL) || (G10_16PL == 0)
#define  MG10_12_116PL    ~(1 << 15)
#else
#define  MG10_12_116PL    0xFFFF
#endif

#define  MG10_12_112PL	0xF7FF
#define  MG10_12    (MG10_12_11PL & MG10_12_12PL & MG10_12_13PL & MG10_12_14PL & \
                    MG10_12_15PL & MG10_12_16PL & MG10_12_17PL & MG10_12_18PL & \
                    MG10_12_19PL & MG10_12_110PL & MG10_12_111PL & MG10_12_112PL & \
                    MG10_12_113PL & MG10_12_114PL & MG10_12_115PL & MG10_12_116PL)
// End of MG10_12:
// Beginning of MG1013:
#if (G10_1PL >= G10_13PL) || (G10_1PL == 0)
#define  MG10_13_11PL    ~(1 << 0)
#else
#define  MG10_13_11PL    0xFFFF
#endif

#if (G10_2PL >= G10_13PL) || (G10_2PL == 0)
#define  MG10_13_12PL    ~(1 << 1)
#else
#define  MG10_13_12PL    0xFFFF
#endif

#if (G10_3PL >= G10_13PL) || (G10_3PL == 0)
#define  MG10_13_13PL    ~(1 << 2)
#else
#define  MG10_13_13PL    0xFFFF
#endif

#if (G10_4PL >= G10_13PL) || (G10_4PL == 0)
#define  MG10_13_14PL    ~(1 << 3)
#else
#define  MG10_13_14PL    0xFFFF
#endif

#if (G10_5PL >= G10_13PL) || (G10_5PL == 0)
#define  MG10_13_15PL    ~(1 << 4)
#else
#define  MG10_13_15PL    0xFFFF
#endif

#if (G10_6PL >= G10_13PL) || (G10_6PL == 0)
#define  MG10_13_16PL    ~(1 << 5)
#else
#define  MG10_13_16PL    0xFFFF
#endif

#if (G10_7PL >= G10_13PL) || (G10_7PL == 0)
#define  MG10_13_17PL    ~(1 << 6)
#else
#define  MG10_13_17PL    0xFFFF
#endif

#if (G10_8PL >= G10_13PL) || (G10_8PL == 0)
#define  MG10_13_18PL    ~(1 << 7)
#else
#define  MG10_13_18PL    0xFFFF
#endif

#if (G10_9PL >= G10_13PL) || (G10_9PL == 0)
#define  MG10_13_19PL    ~(1 << 8)
#else
#define  MG10_13_19PL    0xFFFF
#endif

#if (G10_10PL >= G10_13PL) || (G10_10PL == 0)
#define  MG10_13_110PL    ~(1 << 9)
#else
#define  MG10_13_110PL    0xFFFF
#endif

#if (G10_11PL >= G10_13PL) || (G10_11PL == 0)
#define  MG10_13_111PL    ~(1 << 10)
#else
#define  MG10_13_111PL    0xFFFF
#endif

#if (G10_12PL >= G10_13PL) || (G10_12PL == 0)
#define  MG10_13_112PL    ~(1 << 11)
#else
#define  MG10_13_112PL    0xFFFF
#endif

#if (G10_14PL >= G10_13PL) || (G10_14PL == 0)
#define  MG10_13_114PL    ~(1 << 13)
#else
#define  MG10_13_114PL    0xFFFF
#endif

#if (G10_15PL >= G10_13PL) || (G10_15PL == 0)
#define  MG10_13_115PL    ~(1 << 14)
#else
#define  MG10_13_115PL    0xFFFF
#endif

#if (G10_16PL >= G10_13PL) || (G10_16PL == 0)
#define  MG10_13_116PL    ~(1 << 15)
#else
#define  MG10_13_116PL    0xFFFF
#endif

#define  MG10_13_113PL	0xEFFF
#define  MG10_13    (MG10_13_11PL & MG10_13_12PL & MG10_13_13PL & MG10_13_14PL & \
                    MG10_13_15PL & MG10_13_16PL & MG10_13_17PL & MG10_13_18PL & \
                    MG10_13_19PL & MG10_13_110PL & MG10_13_111PL & MG10_13_112PL & \
                    MG10_13_113PL & MG10_13_114PL & MG10_13_115PL & MG10_13_116PL)
// End of MG10_13:
// Beginning of MG1014:
#if (G10_1PL >= G10_14PL) || (G10_1PL == 0)
#define  MG10_14_11PL    ~(1 << 0)
#else
#define  MG10_14_11PL    0xFFFF
#endif

#if (G10_2PL >= G10_14PL) || (G10_2PL == 0)
#define  MG10_14_12PL    ~(1 << 1)
#else
#define  MG10_14_12PL    0xFFFF
#endif

#if (G10_3PL >= G10_14PL) || (G10_3PL == 0)
#define  MG10_14_13PL    ~(1 << 2)
#else
#define  MG10_14_13PL    0xFFFF
#endif

#if (G10_4PL >= G10_14PL) || (G10_4PL == 0)
#define  MG10_14_14PL    ~(1 << 3)
#else
#define  MG10_14_14PL    0xFFFF
#endif

#if (G10_5PL >= G10_14PL) || (G10_5PL == 0)
#define  MG10_14_15PL    ~(1 << 4)
#else
#define  MG10_14_15PL    0xFFFF
#endif

#if (G10_6PL >= G10_14PL) || (G10_6PL == 0)
#define  MG10_14_16PL    ~(1 << 5)
#else
#define  MG10_14_16PL    0xFFFF
#endif

#if (G10_7PL >= G10_14PL) || (G10_7PL == 0)
#define  MG10_14_17PL    ~(1 << 6)
#else
#define  MG10_14_17PL    0xFFFF
#endif

#if (G10_8PL >= G10_14PL) || (G10_8PL == 0)
#define  MG10_14_18PL    ~(1 << 7)
#else
#define  MG10_14_18PL    0xFFFF
#endif

#if (G10_9PL >= G10_14PL) || (G10_9PL == 0)
#define  MG10_14_19PL    ~(1 << 8)
#else
#define  MG10_14_19PL    0xFFFF
#endif

#if (G10_10PL >= G10_14PL) || (G10_10PL == 0)
#define  MG10_14_110PL    ~(1 << 9)
#else
#define  MG10_14_110PL    0xFFFF
#endif

#if (G10_11PL >= G10_14PL) || (G10_11PL == 0)
#define  MG10_14_111PL    ~(1 << 10)
#else
#define  MG10_14_111PL    0xFFFF
#endif

#if (G10_12PL >= G10_14PL) || (G10_12PL == 0)
#define  MG10_14_112PL    ~(1 << 11)
#else
#define  MG10_14_112PL    0xFFFF
#endif

#if (G10_13PL >= G10_14PL) || (G10_13PL == 0)
#define  MG10_14_113PL    ~(1 << 12)
#else
#define  MG10_14_113PL    0xFFFF
#endif

#if (G10_15PL >= G10_14PL) || (G10_15PL == 0)
#define  MG10_14_115PL    ~(1 << 14)
#else
#define  MG10_14_115PL    0xFFFF
#endif

#if (G10_16PL >= G10_14PL) || (G10_16PL == 0)
#define  MG10_14_116PL    ~(1 << 15)
#else
#define  MG10_14_116PL    0xFFFF
#endif

#define  MG10_14_114PL	0xDFFF
#define  MG10_14    (MG10_14_11PL & MG10_14_12PL & MG10_14_13PL & MG10_14_14PL & \
                    MG10_14_15PL & MG10_14_16PL & MG10_14_17PL & MG10_14_18PL & \
                    MG10_14_19PL & MG10_14_110PL & MG10_14_111PL & MG10_14_112PL & \
                    MG10_14_113PL & MG10_14_114PL & MG10_14_115PL & MG10_14_116PL)
// End of MG10_14:
// Beginning of MG1015:
#if (G10_1PL >= G10_15PL) || (G10_1PL == 0)
#define  MG10_15_11PL    ~(1 << 0)
#else
#define  MG10_15_11PL    0xFFFF
#endif

#if (G10_2PL >= G10_15PL) || (G10_2PL == 0)
#define  MG10_15_12PL    ~(1 << 1)
#else
#define  MG10_15_12PL    0xFFFF
#endif

#if (G10_3PL >= G10_15PL) || (G10_3PL == 0)
#define  MG10_15_13PL    ~(1 << 2)
#else
#define  MG10_15_13PL    0xFFFF
#endif

