dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2837xd/examples/cpu1/boostxl_afe031_f28379d_dacmode/cpu01/boostxl_afe031_f28379d_dacmode_isr.h
#if (G11_3PL >= G11_2PL) || (G11_3PL == 0)
#define  MG11_2_13PL    ~(1 << 2)
#else
#define  MG11_2_13PL    0xFFFF
#endif

#if (G11_4PL >= G11_2PL) || (G11_4PL == 0)
#define  MG11_2_14PL    ~(1 << 3)
#else
#define  MG11_2_14PL    0xFFFF
#endif

#if (G11_5PL >= G11_2PL) || (G11_5PL == 0)
#define  MG11_2_15PL    ~(1 << 4)
#else
#define  MG11_2_15PL    0xFFFF
#endif

#if (G11_6PL >= G11_2PL) || (G11_6PL == 0)
#define  MG11_2_16PL    ~(1 << 5)
#else
#define  MG11_2_16PL    0xFFFF
#endif

#if (G11_7PL >= G11_2PL) || (G11_7PL == 0)
#define  MG11_2_17PL    ~(1 << 6)
#else
#define  MG11_2_17PL    0xFFFF
#endif

#if (G11_8PL >= G11_2PL) || (G11_8PL == 0)
#define  MG11_2_18PL    ~(1 << 7)
#else
#define  MG11_2_18PL    0xFFFF
#endif

#if (G11_9PL >= G11_2PL) || (G11_9PL == 0)
#define  MG11_2_19PL    ~(1 << 8)
#else
#define  MG11_2_19PL    0xFFFF
#endif

#if (G11_10PL >= G11_2PL) || (G11_10PL == 0)
#define  MG11_2_110PL    ~(1 << 9)
#else
#define  MG11_2_110PL    0xFFFF
#endif

#if (G11_11PL >= G11_2PL) || (G11_11PL == 0)
#define  MG11_2_111PL    ~(1 << 10)
#else
#define  MG11_2_111PL    0xFFFF
#endif

#if (G11_12PL >= G11_2PL) || (G11_12PL == 0)
#define  MG11_2_112PL    ~(1 << 11)
#else
#define  MG11_2_112PL    0xFFFF
#endif

#if (G11_13PL >= G11_2PL) || (G11_13PL == 0)
#define  MG11_2_113PL    ~(1 << 12)
#else
#define  MG11_2_113PL    0xFFFF
#endif

#if (G11_14PL >= G11_2PL) || (G11_14PL == 0)
#define  MG11_2_114PL    ~(1 << 13)
#else
#define  MG11_2_114PL    0xFFFF
#endif

#if (G11_15PL >= G11_2PL) || (G11_15PL == 0)
#define  MG11_2_115PL    ~(1 << 14)
#else
#define  MG11_2_115PL    0xFFFF
#endif

#if (G11_16PL >= G11_2PL) || (G11_16PL == 0)
#define  MG11_2_116PL    ~(1 << 15)
#else
#define  MG11_2_116PL    0xFFFF
#endif

#define  MG11_2_12PL	0xFFFD
#define  MG11_2    (MG11_2_11PL & MG11_2_12PL & MG11_2_13PL & MG11_2_14PL & \
                    MG11_2_15PL & MG11_2_16PL & MG11_2_17PL & MG11_2_18PL & \
                    MG11_2_19PL & MG11_2_110PL & MG11_2_111PL & MG11_2_112PL & \
                    MG11_2_113PL & MG11_2_114PL & MG11_2_115PL & MG11_2_116PL)
// End of MG11_2:
// Beginning of MG113:
#if (G11_1PL >= G11_3PL) || (G11_1PL == 0)
#define  MG11_3_11PL    ~(1 << 0)
#else
#define  MG11_3_11PL    0xFFFF
#endif

#if (G11_2PL >= G11_3PL) || (G11_2PL == 0)
#define  MG11_3_12PL    ~(1 << 1)
#else
#define  MG11_3_12PL    0xFFFF
#endif

#if (G11_4PL >= G11_3PL) || (G11_4PL == 0)
#define  MG11_3_14PL    ~(1 << 3)
#else
#define  MG11_3_14PL    0xFFFF
#endif

#if (G11_5PL >= G11_3PL) || (G11_5PL == 0)
#define  MG11_3_15PL    ~(1 << 4)
#else
#define  MG11_3_15PL    0xFFFF
#endif

#if (G11_6PL >= G11_3PL) || (G11_6PL == 0)
#define  MG11_3_16PL    ~(1 << 5)
#else
#define  MG11_3_16PL    0xFFFF
#endif

#if (G11_7PL >= G11_3PL) || (G11_7PL == 0)
#define  MG11_3_17PL    ~(1 << 6)
#else
#define  MG11_3_17PL    0xFFFF
#endif

#if (G11_8PL >= G11_3PL) || (G11_8PL == 0)
#define  MG11_3_18PL    ~(1 << 7)
#else
#define  MG11_3_18PL    0xFFFF
#endif

#if (G11_9PL >= G11_3PL) || (G11_9PL == 0)
#define  MG11_3_19PL    ~(1 << 8)
#else
#define  MG11_3_19PL    0xFFFF
#endif

#if (G11_10PL >= G11_3PL) || (G11_10PL == 0)
#define  MG11_3_110PL    ~(1 << 9)
#else
#define  MG11_3_110PL    0xFFFF
#endif

#if (G11_11PL >= G11_3PL) || (G11_11PL == 0)
#define  MG11_3_111PL    ~(1 << 10)
#else
#define  MG11_3_111PL    0xFFFF
#endif

#if (G11_12PL >= G11_3PL) || (G11_12PL == 0)
#define  MG11_3_112PL    ~(1 << 11)
#else
#define  MG11_3_112PL    0xFFFF
#endif

#if (G11_13PL >= G11_3PL) || (G11_13PL == 0)
#define  MG11_3_113PL    ~(1 << 12)
#else
#define  MG11_3_113PL    0xFFFF
#endif

#if (G11_14PL >= G11_3PL) || (G11_14PL == 0)
#define  MG11_3_114PL    ~(1 << 13)
#else
#define  MG11_3_114PL    0xFFFF
#endif

#if (G11_15PL >= G11_3PL) || (G11_15PL == 0)
#define  MG11_3_115PL    ~(1 << 14)
#else
#define  MG11_3_115PL    0xFFFF
#endif

#if (G11_16PL >= G11_3PL) || (G11_16PL == 0)
#define  MG11_3_116PL    ~(1 << 15)
#else
#define  MG11_3_116PL    0xFFFF
#endif

#define  MG11_3_13PL	0xFFFB
#define  MG11_3    (MG11_3_11PL & MG11_3_12PL & MG11_3_13PL & MG11_3_14PL & \
                    MG11_3_15PL & MG11_3_16PL & MG11_3_17PL & MG11_3_18PL & \
                    MG11_3_19PL & MG11_3_110PL & MG11_3_111PL & MG11_3_112PL & \
                    MG11_3_113PL & MG11_3_114PL & MG11_3_115PL & MG11_3_116PL)
// End of MG11_3:
// Beginning of MG114:
#if (G11_1PL >= G11_4PL) || (G11_1PL == 0)
#define  MG11_4_11PL    ~(1 << 0)
#else
#define  MG11_4_11PL    0xFFFF
#endif

#if (G11_2PL >= G11_4PL) || (G11_2PL == 0)
#define  MG11_4_12PL    ~(1 << 1)
#else
#define  MG11_4_12PL    0xFFFF
#endif

#if (G11_3PL >= G11_4PL) || (G11_3PL == 0)
#define  MG11_4_13PL    ~(1 << 2)
#else
#define  MG11_4_13PL    0xFFFF
#endif

#if (G11_5PL >= G11_4PL) || (G11_5PL == 0)
#define  MG11_4_15PL    ~(1 << 4)
#else
#define  MG11_4_15PL    0xFFFF
#endif

#if (G11_6PL >= G11_4PL) || (G11_6PL == 0)
#define  MG11_4_16PL    ~(1 << 5)
#else
#define  MG11_4_16PL    0xFFFF
#endif

#if (G11_7PL >= G11_4PL) || (G11_7PL == 0)
#define  MG11_4_17PL    ~(1 << 6)
#else
#define  MG11_4_17PL    0xFFFF
#endif

#if (G11_8PL >= G11_4PL) || (G11_8PL == 0)
#define  MG11_4_18PL    ~(1 << 7)
#else
#define  MG11_4_18PL    0xFFFF
#endif

#if (G11_9PL >= G11_4PL) || (G11_9PL == 0)
#define  MG11_4_19PL    ~(1 << 8)
#else
#define  MG11_4_19PL    0xFFFF
#endif

#if (G11_10PL >= G11_4PL) || (G11_10PL == 0)
#define  MG11_4_110PL    ~(1 << 9)
#else
#define  MG11_4_110PL    0xFFFF
#endif

#if (G11_11PL >= G11_4PL) || (G11_11PL == 0)
#define  MG11_4_111PL    ~(1 << 10)
#else
#define  MG11_4_111PL    0xFFFF
#endif

#if (G11_12PL >= G11_4PL) || (G11_12PL == 0)
#define  MG11_4_112PL    ~(1 << 11)
#else
#define  MG11_4_112PL    0xFFFF
#endif

#if (G11_13PL >= G11_4PL) || (G11_13PL == 0)
#define  MG11_4_113PL    ~(1 << 12)
#else
#define  MG11_4_113PL    0xFFFF
#endif

#if (G11_14PL >= G11_4PL) || (G11_14PL == 0)
#define  MG11_4_114PL    ~(1 << 13)
#else
#define  MG11_4_114PL    0xFFFF
#endif

#if (G11_15PL >= G11_4PL) || (G11_15PL == 0)
#define  MG11_4_115PL    ~(1 << 14)
#else
#define  MG11_4_115PL    0xFFFF
#endif

#if (G11_16PL >= G11_4PL) || (G11_16PL == 0)
#define  MG11_4_116PL    ~(1 << 15)
#else
#define  MG11_4_116PL    0xFFFF
#endif

#define  MG11_4_14PL	0xFFF7
#define  MG11_4    (MG11_4_11PL & MG11_4_12PL & MG11_4_13PL & MG11_4_14PL & \
                    MG11_4_15PL & MG11_4_16PL & MG11_4_17PL & MG11_4_18PL & \
                    MG11_4_19PL & MG11_4_110PL & MG11_4_111PL & MG11_4_112PL & \
                    MG11_4_113PL & MG11_4_114PL & MG11_4_115PL & MG11_4_116PL)
// End of MG11_4:
// Beginning of MG115:
#if (G11_1PL >= G11_5PL) || (G11_1PL == 0)
#define  MG11_5_11PL    ~(1 << 0)
#else
#define  MG11_5_11PL    0xFFFF
#endif

