dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2837xd/examples/cpu1/boostxl_afe031_f28379d_dacmode/cpu01/boostxl_afe031_f28379d_dacmode_isr.h
#if (G11_2PL >= G11_8PL) || (G11_2PL == 0)
#define  MG11_8_12PL    ~(1 << 1)
#else
#define  MG11_8_12PL    0xFFFF
#endif

#if (G11_3PL >= G11_8PL) || (G11_3PL == 0)
#define  MG11_8_13PL    ~(1 << 2)
#else
#define  MG11_8_13PL    0xFFFF
#endif

#if (G11_4PL >= G11_8PL) || (G11_4PL == 0)
#define  MG11_8_14PL    ~(1 << 3)
#else
#define  MG11_8_14PL    0xFFFF
#endif

#if (G11_5PL >= G11_8PL) || (G11_5PL == 0)
#define  MG11_8_15PL    ~(1 << 4)
#else
#define  MG11_8_15PL    0xFFFF
#endif

#if (G11_6PL >= G11_8PL) || (G11_6PL == 0)
#define  MG11_8_16PL    ~(1 << 5)
#else
#define  MG11_8_16PL    0xFFFF
#endif

#if (G11_7PL >= G11_8PL) || (G11_7PL == 0)
#define  MG11_8_17PL    ~(1 << 6)
#else
#define  MG11_8_17PL    0xFFFF
#endif

#if (G11_9PL >= G11_8PL) || (G11_9PL == 0)
#define  MG11_8_19PL    ~(1 << 8)
#else
#define  MG11_8_19PL    0xFFFF
#endif

#if (G11_10PL >= G11_8PL) || (G11_10PL == 0)
#define  MG11_8_110PL    ~(1 << 9)
#else
#define  MG11_8_110PL    0xFFFF
#endif

#if (G11_11PL >= G11_8PL) || (G11_11PL == 0)
#define  MG11_8_111PL    ~(1 << 10)
#else
#define  MG11_8_111PL    0xFFFF
#endif

#if (G11_12PL >= G11_8PL) || (G11_12PL == 0)
#define  MG11_8_112PL    ~(1 << 11)
#else
#define  MG11_8_112PL    0xFFFF
#endif

#if (G11_13PL >= G11_8PL) || (G11_13PL == 0)
#define  MG11_8_113PL    ~(1 << 12)
#else
#define  MG11_8_113PL    0xFFFF
#endif

#if (G11_14PL >= G11_8PL) || (G11_14PL == 0)
#define  MG11_8_114PL    ~(1 << 13)
#else
#define  MG11_8_114PL    0xFFFF
#endif

#if (G11_15PL >= G11_8PL) || (G11_15PL == 0)
#define  MG11_8_115PL    ~(1 << 14)
#else
#define  MG11_8_115PL    0xFFFF
#endif

#if (G11_16PL >= G11_8PL) || (G11_16PL == 0)
#define  MG11_8_116PL    ~(1 << 15)
#else
#define  MG11_8_116PL    0xFFFF
#endif

#define  MG11_8_18PL	0xFF7F
#define  MG11_8    (MG11_8_11PL & MG11_8_12PL & MG11_8_13PL & MG11_8_14PL & \
                    MG11_8_15PL & MG11_8_16PL & MG11_8_17PL & MG11_8_18PL & \
                    MG11_8_19PL & MG11_8_110PL & MG11_8_111PL & MG11_8_112PL & \
                    MG11_8_113PL & MG11_8_114PL & MG11_8_115PL & MG11_8_116PL)
// End of MG11_8:
// Beginning of MG119:
#if (G11_1PL >= G11_9PL) || (G11_1PL == 0)
#define  MG11_9_11PL    ~(1 << 0)
#else
#define  MG11_9_11PL    0xFFFF
#endif

#if (G11_2PL >= G11_9PL) || (G11_2PL == 0)
#define  MG11_9_12PL    ~(1 << 1)
#else
#define  MG11_9_12PL    0xFFFF
#endif

#if (G11_3PL >= G11_9PL) || (G11_3PL == 0)
#define  MG11_9_13PL    ~(1 << 2)
#else
#define  MG11_9_13PL    0xFFFF
#endif

#if (G11_4PL >= G11_9PL) || (G11_4PL == 0)
#define  MG11_9_14PL    ~(1 << 3)
#else
#define  MG11_9_14PL    0xFFFF
#endif

#if (G11_5PL >= G11_9PL) || (G11_5PL == 0)
#define  MG11_9_15PL    ~(1 << 4)
#else
#define  MG11_9_15PL    0xFFFF
#endif

#if (G11_6PL >= G11_9PL) || (G11_6PL == 0)
#define  MG11_9_16PL    ~(1 << 5)
#else
#define  MG11_9_16PL    0xFFFF
#endif

#if (G11_7PL >= G11_9PL) || (G11_7PL == 0)
#define  MG11_9_17PL    ~(1 << 6)
#else
#define  MG11_9_17PL    0xFFFF
#endif

#if (G11_8PL >= G11_9PL) || (G11_8PL == 0)
#define  MG11_9_18PL    ~(1 << 7)
#else
#define  MG11_9_18PL    0xFFFF
#endif

#if (G11_10PL >= G11_9PL) || (G11_10PL == 0)
#define  MG11_9_110PL    ~(1 << 9)
#else
#define  MG11_9_110PL    0xFFFF
#endif

#if (G11_11PL >= G11_9PL) || (G11_11PL == 0)
#define  MG11_9_111PL    ~(1 << 10)
#else
#define  MG11_9_111PL    0xFFFF
#endif

#if (G11_12PL >= G11_9PL) || (G11_12PL == 0)
#define  MG11_9_112PL    ~(1 << 11)
#else
#define  MG11_9_112PL    0xFFFF
#endif

#if (G11_13PL >= G11_9PL) || (G11_13PL == 0)
#define  MG11_9_113PL    ~(1 << 12)
#else
#define  MG11_9_113PL    0xFFFF
#endif

#if (G11_14PL >= G11_9PL) || (G11_14PL == 0)
#define  MG11_9_114PL    ~(1 << 13)
#else
#define  MG11_9_114PL    0xFFFF
#endif

#if (G11_15PL >= G11_9PL) || (G11_15PL == 0)
#define  MG11_9_115PL    ~(1 << 14)
#else
#define  MG11_9_115PL    0xFFFF
#endif

#if (G11_16PL >= G11_9PL) || (G11_16PL == 0)
#define  MG11_9_116PL    ~(1 << 15)
#else
#define  MG11_9_116PL    0xFFFF
#endif

#define  MG11_9_19PL	0xFEFF
#define  MG11_9    (MG11_9_11PL & MG11_9_12PL & MG11_9_13PL & MG11_9_14PL & \
                    MG11_9_15PL & MG11_9_16PL & MG11_9_17PL & MG11_9_18PL & \
                    MG11_9_19PL & MG11_9_110PL & MG11_9_111PL & MG11_9_112PL & \
                    MG11_9_113PL & MG11_9_114PL & MG11_9_115PL & MG11_9_116PL)
// End of MG11_9:
// Beginning of MG1110:
#if (G11_1PL >= G11_10PL) || (G11_1PL == 0)
#define  MG11_10_11PL    ~(1 << 0)
#else
#define  MG11_10_11PL    0xFFFF
#endif

#if (G11_2PL >= G11_10PL) || (G11_2PL == 0)
#define  MG11_10_12PL    ~(1 << 1)
#else
#define  MG11_10_12PL    0xFFFF
#endif

#if (G11_3PL >= G11_10PL) || (G11_3PL == 0)
#define  MG11_10_13PL    ~(1 << 2)
#else
#define  MG11_10_13PL    0xFFFF
#endif

#if (G11_4PL >= G11_10PL) || (G11_4PL == 0)
#define  MG11_10_14PL    ~(1 << 3)
#else
#define  MG11_10_14PL    0xFFFF
#endif

#if (G11_5PL >= G11_10PL) || (G11_5PL == 0)
#define  MG11_10_15PL    ~(1 << 4)
#else
#define  MG11_10_15PL    0xFFFF
#endif

#if (G11_6PL >= G11_10PL) || (G11_6PL == 0)
#define  MG11_10_16PL    ~(1 << 5)
#else
#define  MG11_10_16PL    0xFFFF
#endif

#if (G11_7PL >= G11_10PL) || (G11_7PL == 0)
#define  MG11_10_17PL    ~(1 << 6)
#else
#define  MG11_10_17PL    0xFFFF
#endif

#if (G11_8PL >= G11_10PL) || (G11_8PL == 0)
#define  MG11_10_18PL    ~(1 << 7)
#else
#define  MG11_10_18PL    0xFFFF
#endif

#if (G11_9PL >= G11_10PL) || (G11_9PL == 0)
#define  MG11_10_19PL    ~(1 << 8)
#else
#define  MG11_10_19PL    0xFFFF
#endif

#if (G11_11PL >= G11_10PL) || (G11_11PL == 0)
#define  MG11_10_111PL    ~(1 << 10)
#else
#define  MG11_10_111PL    0xFFFF
#endif

#if (G11_12PL >= G11_10PL) || (G11_12PL == 0)
#define  MG11_10_112PL    ~(1 << 11)
#else
#define  MG11_10_112PL    0xFFFF
#endif

#if (G11_13PL >= G11_10PL) || (G11_13PL == 0)
#define  MG11_10_113PL    ~(1 << 12)
#else
#define  MG11_10_113PL    0xFFFF
#endif

#if (G11_14PL >= G11_10PL) || (G11_14PL == 0)
#define  MG11_10_114PL    ~(1 << 13)
#else
#define  MG11_10_114PL    0xFFFF
#endif

#if (G11_15PL >= G11_10PL) || (G11_15PL == 0)
#define  MG11_10_115PL    ~(1 << 14)
#else
#define  MG11_10_115PL    0xFFFF
#endif

#if (G11_16PL >= G11_10PL) || (G11_16PL == 0)
#define  MG11_10_116PL    ~(1 << 15)
#else
#define  MG11_10_116PL    0xFFFF
#endif

#define  MG11_10_110PL	0xFDFF
#define  MG11_10    (MG11_10_11PL & MG11_10_12PL & MG11_10_13PL & MG11_10_14PL & \
                    MG11_10_15PL & MG11_10_16PL & MG11_10_17PL & MG11_10_18PL & \
                    MG11_10_19PL & MG11_10_110PL & MG11_10_111PL & MG11_10_112PL & \
                    MG11_10_113PL & MG11_10_114PL & MG11_10_115PL & MG11_10_116PL)
// End of MG11_10:
// Beginning of MG1111:
#if (G11_1PL >= G11_11PL) || (G11_1PL == 0)
#define  MG11_11_11PL    ~(1 << 0)
#else
#define  MG11_11_11PL    0xFFFF
#endif

#if (G11_2PL >= G11_11PL) || (G11_2PL == 0)
#define  MG11_11_12PL    ~(1 << 1)
#else
#define  MG11_11_12PL    0xFFFF
#endif

