dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2837xd/examples/cpu1/boostxl_afe031_f28379d_dacmode/cpu01/boostxl_afe031_f28379d_dacmode_isr.h
#if (G12_16PL >= G12_8PL) || (G12_16PL == 0)
#define  MG12_8_116PL    ~(1 << 15)
#else
#define  MG12_8_116PL    0xFFFF
#endif

#define  MG12_8_18PL	0xFF7F
#define  MG12_8    (MG12_8_11PL & MG12_8_12PL & MG12_8_13PL & MG12_8_14PL & \
                    MG12_8_15PL & MG12_8_16PL & MG12_8_17PL & MG12_8_18PL & \
                    MG12_8_19PL & MG12_8_110PL & MG12_8_111PL & MG12_8_112PL & \
                    MG12_8_113PL & MG12_8_114PL & MG12_8_115PL & MG12_8_116PL)
// End of MG12_8:
// Beginning of MG129:
#if (G12_1PL >= G12_9PL) || (G12_1PL == 0)
#define  MG12_9_11PL    ~(1 << 0)
#else
#define  MG12_9_11PL    0xFFFF
#endif

#if (G12_2PL >= G12_9PL) || (G12_2PL == 0)
#define  MG12_9_12PL    ~(1 << 1)
#else
#define  MG12_9_12PL    0xFFFF
#endif

#if (G12_3PL >= G12_9PL) || (G12_3PL == 0)
#define  MG12_9_13PL    ~(1 << 2)
#else
#define  MG12_9_13PL    0xFFFF
#endif

#if (G12_4PL >= G12_9PL) || (G12_4PL == 0)
#define  MG12_9_14PL    ~(1 << 3)
#else
#define  MG12_9_14PL    0xFFFF
#endif

#if (G12_5PL >= G12_9PL) || (G12_5PL == 0)
#define  MG12_9_15PL    ~(1 << 4)
#else
#define  MG12_9_15PL    0xFFFF
#endif

#if (G12_6PL >= G12_9PL) || (G12_6PL == 0)
#define  MG12_9_16PL    ~(1 << 5)
#else
#define  MG12_9_16PL    0xFFFF
#endif

#if (G12_7PL >= G12_9PL) || (G12_7PL == 0)
#define  MG12_9_17PL    ~(1 << 6)
#else
#define  MG12_9_17PL    0xFFFF
#endif

#if (G12_8PL >= G12_9PL) || (G12_8PL == 0)
#define  MG12_9_18PL    ~(1 << 7)
#else
#define  MG12_9_18PL    0xFFFF
#endif

#if (G12_10PL >= G12_9PL) || (G12_10PL == 0)
#define  MG12_9_110PL    ~(1 << 9)
#else
#define  MG12_9_110PL    0xFFFF
#endif

#if (G12_11PL >= G12_9PL) || (G12_11PL == 0)
#define  MG12_9_111PL    ~(1 << 10)
#else
#define  MG12_9_111PL    0xFFFF
#endif

#if (G12_12PL >= G12_9PL) || (G12_12PL == 0)
#define  MG12_9_112PL    ~(1 << 11)
#else
#define  MG12_9_112PL    0xFFFF
#endif

#if (G12_13PL >= G12_9PL) || (G12_13PL == 0)
#define  MG12_9_113PL    ~(1 << 12)
#else
#define  MG12_9_113PL    0xFFFF
#endif

#if (G12_14PL >= G12_9PL) || (G12_14PL == 0)
#define  MG12_9_114PL    ~(1 << 13)
#else
#define  MG12_9_114PL    0xFFFF
#endif

#if (G12_15PL >= G12_9PL) || (G12_15PL == 0)
#define  MG12_9_115PL    ~(1 << 14)
#else
#define  MG12_9_115PL    0xFFFF
#endif

#if (G12_16PL >= G12_9PL) || (G12_16PL == 0)
#define  MG12_9_116PL    ~(1 << 15)
#else
#define  MG12_9_116PL    0xFFFF
#endif

#define  MG12_9_19PL	0xFEFF
#define  MG12_9    (MG12_9_11PL & MG12_9_12PL & MG12_9_13PL & MG12_9_14PL & \
                    MG12_9_15PL & MG12_9_16PL & MG12_9_17PL & MG12_9_18PL & \
                    MG12_9_19PL & MG12_9_110PL & MG12_9_111PL & MG12_9_112PL & \
                    MG12_9_113PL & MG12_9_114PL & MG12_9_115PL & MG12_9_116PL)
// End of MG12_9:
// Beginning of MG1210:
#if (G12_1PL >= G12_10PL) || (G12_1PL == 0)
#define  MG12_10_11PL    ~(1 << 0)
#else
#define  MG12_10_11PL    0xFFFF
#endif

#if (G12_2PL >= G12_10PL) || (G12_2PL == 0)
#define  MG12_10_12PL    ~(1 << 1)
#else
#define  MG12_10_12PL    0xFFFF
#endif

#if (G12_3PL >= G12_10PL) || (G12_3PL == 0)
#define  MG12_10_13PL    ~(1 << 2)
#else
#define  MG12_10_13PL    0xFFFF
#endif

#if (G12_4PL >= G12_10PL) || (G12_4PL == 0)
#define  MG12_10_14PL    ~(1 << 3)
#else
#define  MG12_10_14PL    0xFFFF
#endif

#if (G12_5PL >= G12_10PL) || (G12_5PL == 0)
#define  MG12_10_15PL    ~(1 << 4)
#else
#define  MG12_10_15PL    0xFFFF
#endif

#if (G12_6PL >= G12_10PL) || (G12_6PL == 0)
#define  MG12_10_16PL    ~(1 << 5)
#else
#define  MG12_10_16PL    0xFFFF
#endif

#if (G12_7PL >= G12_10PL) || (G12_7PL == 0)
#define  MG12_10_17PL    ~(1 << 6)
#else
#define  MG12_10_17PL    0xFFFF
#endif

#if (G12_8PL >= G12_10PL) || (G12_8PL == 0)
#define  MG12_10_18PL    ~(1 << 7)
#else
#define  MG12_10_18PL    0xFFFF
#endif

#if (G12_9PL >= G12_10PL) || (G12_9PL == 0)
#define  MG12_10_19PL    ~(1 << 8)
#else
#define  MG12_10_19PL    0xFFFF
#endif

#if (G12_11PL >= G12_10PL) || (G12_11PL == 0)
#define  MG12_10_111PL    ~(1 << 10)
#else
#define  MG12_10_111PL    0xFFFF
#endif

#if (G12_12PL >= G12_10PL) || (G12_12PL == 0)
#define  MG12_10_112PL    ~(1 << 11)
#else
#define  MG12_10_112PL    0xFFFF
#endif

#if (G12_13PL >= G12_10PL) || (G12_13PL == 0)
#define  MG12_10_113PL    ~(1 << 12)
#else
#define  MG12_10_113PL    0xFFFF
#endif

#if (G12_14PL >= G12_10PL) || (G12_14PL == 0)
#define  MG12_10_114PL    ~(1 << 13)
#else
#define  MG12_10_114PL    0xFFFF
#endif

#if (G12_15PL >= G12_10PL) || (G12_15PL == 0)
#define  MG12_10_115PL    ~(1 << 14)
#else
#define  MG12_10_115PL    0xFFFF
#endif

#if (G12_16PL >= G12_10PL) || (G12_16PL == 0)
#define  MG12_10_116PL    ~(1 << 15)
#else
#define  MG12_10_116PL    0xFFFF
#endif

#define  MG12_10_110PL	0xFDFF
#define  MG12_10    (MG12_10_11PL & MG12_10_12PL & MG12_10_13PL & MG12_10_14PL & \
                    MG12_10_15PL & MG12_10_16PL & MG12_10_17PL & MG12_10_18PL & \
                    MG12_10_19PL & MG12_10_110PL & MG12_10_111PL & MG12_10_112PL & \
                    MG12_10_113PL & MG12_10_114PL & MG12_10_115PL & MG12_10_116PL)
// End of MG12_10:
// Beginning of MG1211:
#if (G12_1PL >= G12_11PL) || (G12_1PL == 0)
#define  MG12_11_11PL    ~(1 << 0)
#else
#define  MG12_11_11PL    0xFFFF
#endif

#if (G12_2PL >= G12_11PL) || (G12_2PL == 0)
#define  MG12_11_12PL    ~(1 << 1)
#else
#define  MG12_11_12PL    0xFFFF
#endif

#if (G12_3PL >= G12_11PL) || (G12_3PL == 0)
#define  MG12_11_13PL    ~(1 << 2)
#else
#define  MG12_11_13PL    0xFFFF
#endif

#if (G12_4PL >= G12_11PL) || (G12_4PL == 0)
#define  MG12_11_14PL    ~(1 << 3)
#else
#define  MG12_11_14PL    0xFFFF
#endif

#if (G12_5PL >= G12_11PL) || (G12_5PL == 0)
#define  MG12_11_15PL    ~(1 << 4)
#else
#define  MG12_11_15PL    0xFFFF
#endif

#if (G12_6PL >= G12_11PL) || (G12_6PL == 0)
#define  MG12_11_16PL    ~(1 << 5)
#else
#define  MG12_11_16PL    0xFFFF
#endif

#if (G12_7PL >= G12_11PL) || (G12_7PL == 0)
#define  MG12_11_17PL    ~(1 << 6)
#else
#define  MG12_11_17PL    0xFFFF
#endif

#if (G12_8PL >= G12_11PL) || (G12_8PL == 0)
#define  MG12_11_18PL    ~(1 << 7)
#else
#define  MG12_11_18PL    0xFFFF
#endif

#if (G12_9PL >= G12_11PL) || (G12_9PL == 0)
#define  MG12_11_19PL    ~(1 << 8)
#else
#define  MG12_11_19PL    0xFFFF
#endif

#if (G12_10PL >= G12_11PL) || (G12_10PL == 0)
#define  MG12_11_110PL    ~(1 << 9)
#else
#define  MG12_11_110PL    0xFFFF
#endif

