dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2837xd/examples/cpu1/boostxl_afe031_f28379d_dacmode/cpu01/boostxl_afe031_f28379d_dacmode_isr.h
#if (G12_12PL >= G12_11PL) || (G12_12PL == 0)
#define  MG12_11_112PL    ~(1 << 11)
#else
#define  MG12_11_112PL    0xFFFF
#endif

#if (G12_13PL >= G12_11PL) || (G12_13PL == 0)
#define  MG12_11_113PL    ~(1 << 12)
#else
#define  MG12_11_113PL    0xFFFF
#endif

#if (G12_14PL >= G12_11PL) || (G12_14PL == 0)
#define  MG12_11_114PL    ~(1 << 13)
#else
#define  MG12_11_114PL    0xFFFF
#endif

#if (G12_15PL >= G12_11PL) || (G12_15PL == 0)
#define  MG12_11_115PL    ~(1 << 14)
#else
#define  MG12_11_115PL    0xFFFF
#endif

#if (G12_16PL >= G12_11PL) || (G12_16PL == 0)
#define  MG12_11_116PL    ~(1 << 15)
#else
#define  MG12_11_116PL    0xFFFF
#endif

#define  MG12_11_111PL	0xFBFF
#define  MG12_11    (MG12_11_11PL & MG12_11_12PL & MG12_11_13PL & MG12_11_14PL & \
                    MG12_11_15PL & MG12_11_16PL & MG12_11_17PL & MG12_11_18PL & \
                    MG12_11_19PL & MG12_11_110PL & MG12_11_111PL & MG12_11_112PL & \
                    MG12_11_113PL & MG12_11_114PL & MG12_11_115PL & MG12_11_116PL)
// End of MG12_11:
// Beginning of MG1212:
#if (G12_1PL >= G12_12PL) || (G12_1PL == 0)
#define  MG12_12_11PL    ~(1 << 0)
#else
#define  MG12_12_11PL    0xFFFF
#endif

#if (G12_2PL >= G12_12PL) || (G12_2PL == 0)
#define  MG12_12_12PL    ~(1 << 1)
#else
#define  MG12_12_12PL    0xFFFF
#endif

#if (G12_3PL >= G12_12PL) || (G12_3PL == 0)
#define  MG12_12_13PL    ~(1 << 2)
#else
#define  MG12_12_13PL    0xFFFF
#endif

#if (G12_4PL >= G12_12PL) || (G12_4PL == 0)
#define  MG12_12_14PL    ~(1 << 3)
#else
#define  MG12_12_14PL    0xFFFF
#endif

#if (G12_5PL >= G12_12PL) || (G12_5PL == 0)
#define  MG12_12_15PL    ~(1 << 4)
#else
#define  MG12_12_15PL    0xFFFF
#endif

#if (G12_6PL >= G12_12PL) || (G12_6PL == 0)
#define  MG12_12_16PL    ~(1 << 5)
#else
#define  MG12_12_16PL    0xFFFF
#endif

#if (G12_7PL >= G12_12PL) || (G12_7PL == 0)
#define  MG12_12_17PL    ~(1 << 6)
#else
#define  MG12_12_17PL    0xFFFF
#endif

#if (G12_8PL >= G12_12PL) || (G12_8PL == 0)
#define  MG12_12_18PL    ~(1 << 7)
#else
#define  MG12_12_18PL    0xFFFF
#endif

#if (G12_9PL >= G12_12PL) || (G12_9PL == 0)
#define  MG12_12_19PL    ~(1 << 8)
#else
#define  MG12_12_19PL    0xFFFF
#endif

#if (G12_10PL >= G12_12PL) || (G12_10PL == 0)
#define  MG12_12_110PL    ~(1 << 9)
#else
#define  MG12_12_110PL    0xFFFF
#endif

#if (G12_11PL >= G12_12PL) || (G12_11PL == 0)
#define  MG12_12_111PL    ~(1 << 10)
#else
#define  MG12_12_111PL    0xFFFF
#endif

#if (G12_13PL >= G12_12PL) || (G12_13PL == 0)
#define  MG12_12_113PL    ~(1 << 12)
#else
#define  MG12_12_113PL    0xFFFF
#endif

#if (G12_14PL >= G12_12PL) || (G12_14PL == 0)
#define  MG12_12_114PL    ~(1 << 13)
#else
#define  MG12_12_114PL    0xFFFF
#endif

#if (G12_15PL >= G12_12PL) || (G12_15PL == 0)
#define  MG12_12_115PL    ~(1 << 14)
#else
#define  MG12_12_115PL    0xFFFF
#endif

#if (G12_16PL >= G12_12PL) || (G12_16PL == 0)
#define  MG12_12_116PL    ~(1 << 15)
#else
#define  MG12_12_116PL    0xFFFF
#endif

#define  MG12_12_112PL	0xF7FF
#define  MG12_12    (MG12_12_11PL & MG12_12_12PL & MG12_12_13PL & MG12_12_14PL & \
                    MG12_12_15PL & MG12_12_16PL & MG12_12_17PL & MG12_12_18PL & \
                    MG12_12_19PL & MG12_12_110PL & MG12_12_111PL & MG12_12_112PL & \
                    MG12_12_113PL & MG12_12_114PL & MG12_12_115PL & MG12_12_116PL)
// End of MG12_12:
// Beginning of MG1213:
#if (G12_1PL >= G12_13PL) || (G12_1PL == 0)
#define  MG12_13_11PL    ~(1 << 0)
#else
#define  MG12_13_11PL    0xFFFF
#endif

#if (G12_2PL >= G12_13PL) || (G12_2PL == 0)
#define  MG12_13_12PL    ~(1 << 1)
#else
#define  MG12_13_12PL    0xFFFF
#endif

#if (G12_3PL >= G12_13PL) || (G12_3PL == 0)
#define  MG12_13_13PL    ~(1 << 2)
#else
#define  MG12_13_13PL    0xFFFF
#endif

#if (G12_4PL >= G12_13PL) || (G12_4PL == 0)
#define  MG12_13_14PL    ~(1 << 3)
#else
#define  MG12_13_14PL    0xFFFF
#endif

#if (G12_5PL >= G12_13PL) || (G12_5PL == 0)
#define  MG12_13_15PL    ~(1 << 4)
#else
#define  MG12_13_15PL    0xFFFF
#endif

#if (G12_6PL >= G12_13PL) || (G12_6PL == 0)
#define  MG12_13_16PL    ~(1 << 5)
#else
#define  MG12_13_16PL    0xFFFF
#endif

#if (G12_7PL >= G12_13PL) || (G12_7PL == 0)
#define  MG12_13_17PL    ~(1 << 6)
#else
#define  MG12_13_17PL    0xFFFF
#endif

#if (G12_8PL >= G12_13PL) || (G12_8PL == 0)
#define  MG12_13_18PL    ~(1 << 7)
#else
#define  MG12_13_18PL    0xFFFF
#endif

#if (G12_9PL >= G12_13PL) || (G12_9PL == 0)
#define  MG12_13_19PL    ~(1 << 8)
#else
#define  MG12_13_19PL    0xFFFF
#endif

#if (G12_10PL >= G12_13PL) || (G12_10PL == 0)
#define  MG12_13_110PL    ~(1 << 9)
#else
#define  MG12_13_110PL    0xFFFF
#endif

#if (G12_11PL >= G12_13PL) || (G12_11PL == 0)
#define  MG12_13_111PL    ~(1 << 10)
#else
#define  MG12_13_111PL    0xFFFF
#endif

#if (G12_12PL >= G12_13PL) || (G12_12PL == 0)
#define  MG12_13_112PL    ~(1 << 11)
#else
#define  MG12_13_112PL    0xFFFF
#endif

#if (G12_14PL >= G12_13PL) || (G12_14PL == 0)
#define  MG12_13_114PL    ~(1 << 13)
#else
#define  MG12_13_114PL    0xFFFF
#endif

#if (G12_15PL >= G12_13PL) || (G12_15PL == 0)
#define  MG12_13_115PL    ~(1 << 14)
#else
#define  MG12_13_115PL    0xFFFF
#endif

#if (G12_16PL >= G12_13PL) || (G12_16PL == 0)
#define  MG12_13_116PL    ~(1 << 15)
#else
#define  MG12_13_116PL    0xFFFF
#endif

#define  MG12_13_113PL	0xEFFF
#define  MG12_13    (MG12_13_11PL & MG12_13_12PL & MG12_13_13PL & MG12_13_14PL & \
                    MG12_13_15PL & MG12_13_16PL & MG12_13_17PL & MG12_13_18PL & \
                    MG12_13_19PL & MG12_13_110PL & MG12_13_111PL & MG12_13_112PL & \
                    MG12_13_113PL & MG12_13_114PL & MG12_13_115PL & MG12_13_116PL)
// End of MG12_13:
// Beginning of MG1214:
#if (G12_1PL >= G12_14PL) || (G12_1PL == 0)
#define  MG12_14_11PL    ~(1 << 0)
#else
#define  MG12_14_11PL    0xFFFF
#endif

#if (G12_2PL >= G12_14PL) || (G12_2PL == 0)
#define  MG12_14_12PL    ~(1 << 1)
#else
#define  MG12_14_12PL    0xFFFF
#endif

#if (G12_3PL >= G12_14PL) || (G12_3PL == 0)
#define  MG12_14_13PL    ~(1 << 2)
#else
#define  MG12_14_13PL    0xFFFF
#endif

#if (G12_4PL >= G12_14PL) || (G12_4PL == 0)
#define  MG12_14_14PL    ~(1 << 3)
#else
#define  MG12_14_14PL    0xFFFF
#endif

#if (G12_5PL >= G12_14PL) || (G12_5PL == 0)
#define  MG12_14_15PL    ~(1 << 4)
#else
#define  MG12_14_15PL    0xFFFF
#endif

#if (G12_6PL >= G12_14PL) || (G12_6PL == 0)
#define  MG12_14_16PL    ~(1 << 5)
#else
#define  MG12_14_16PL    0xFFFF
#endif

